import React, { useState } from "react";
import styles from "../friends/Friends.module.css";

const Friends = () => {
  const [currentPage, setCurrentPage] = useState(1);

  const handlePageChange = (page) => {
    setCurrentPage(page);
  };

  const divs = [
    <div key={1} className={styles.Friends_Per}>
      <h2>თავი 1</h2>
      {
        <p className={styles.Friends_description}>
          ჩემი აზრით დრო მოვიდა უნივერსიტეტის ბავშვებთან ერთად გატარებული ლამაზი დღეების მინიმალისტური ისტორიები მოვყვე, რომლებიც შეიძლება გარკვეული ადამიანების კატეგორიისთვის ჩვეულებრივი დღეები იყოს, რომლებსაც მეგობრებთან ერთად გაატარებს სადმე ბარში, თუმცა იმდროს სხვა დატვირთვა ქონდა ამ ყველაფერს, შეიძლება დღესდღეობით აღარ ვართ ერთად ეს ხალხი, თუმცა ძალიან ტკბილი და კარგი მოგონებები დაგვრჩა,რომლებსაც აუცილებლად გავიხსენებთ. გამოცდებამდე რამდენიმე საათით ადრე მისვლა და მეცადინეობა. დღემდე ძალიან კარგად მახსენდება ის ფაქტი,რომ მათემატიკის გამოცდამდე ყველა ძაან ნერვიულობდა და 2 კვირით ადრე დაიწყეს სწავლა და მომზადება. მე და ერთმა ჩემმა ნაცნობმა მიშომ წინა დღეს გადავწყვიტეთ რო ცოტახანი ვაკის პარკში ჩავსულიყავით და ერთმანეთთან განგვეხილა რაც ვიცოდით. ისე მოხდა, რომ შუალედურზე ყველაზე დიდი ქულები მე და მიშომ ავიღეთ 35 დან 34 ები. ეს ხო ჩვეულებრივი მომენტია, არაფერი განსაკუთრებული, თუმცა ძალიან კარგი ტკბილი მოგონებაა,რომელსაც გავიხსენებთ რამდენიმე წლის შემდეგ თუ შევხვდით ერთმანეთს. მე თავიდანაც ვახსენე,რომ მინიმალისტური დეტალები არის ის,რაც ჩემნაირ ადამიანებს ბედნიერებას ანიჭებს. ძალიან მიყვარს ზოგადად დეტალების დამახსოვრება.ახლა ვისაუბრებ ადამიანებზე,რომლებიც ამ პერიოდის განმავლობაში გავიცანი და დღემდე ძალიან კარგად ვართ,რისთვისაც თითოეულს ვაფასებ. არვთვლი იმ ხალხს,რომლებიც გაქრნენ ჩემი ცხოვრებიდან.

        </p>
      }
      {
        <p className={styles.Friends_description}>
          უნივერსიტეტის დასაწყისში გავიცანი ნიკა,რომელიც დღესდღეობით ჩემი ძმასავით არის. ძალიან საინტერესოდ განვითარდა ჩვენი ურთიერთობა,როდესაც ერთმანეთი გავიცანით არ ვიყავით ძალიან ახლოს ერთანეთთან,თუმცა ერთ დღესაც უნივერსიტეტში ყოფნის დროს დავიწყეთ საუბარი იმ თემაზე თუ სად ვაპირებდით ზაფხულში დასვენებას. იდეები გავცვალეთ და მოვიფიქრეთ,რომ ერთად წავსულიყავით ზღვაზე. ვფიქრობ,რომ ერთ-ერთი საუკეთესო გადაწყვეტილება იყო ზღვაზე წასვლა ჩემს მეგობრებთან ერთად,რადგან უფრო დავუახლოვდით ერთმანეთს და მას შემდეგ მოვდივართ ერთად ჭირშიც და ლხინშიც. ვერ ჩამოვთვლი ყველა მოგონებას, რადგან ძალიან ბევრი და საინტერესო მოგონება გვაქვს ერთად შექმნილი. ჩვენ ვართ ის ადამიანები,რომლებიც არასდროს იძახიან უარს გართობაზე, შეიძლება ითქვას,რომ ჩემთან შედარებით განსხვავებული ხასიათი აქვს და გარკვეულ საკითხებში სხვადასხვანაირად ვმსჯელობთ, თუმცა მაინც ყოველთვის ვუგებთ ერთმანეთს. ძალიან ხშირად გვქონია სიტუაცია,როცა სადმე გავსულვართ და უბრალოდ ჩვენს მომავალ გეგმებზე გვისაუბრია, რა შეიძლება გავაკეთოთ იმისათვის,რომ ისეთი მომავალი გვქონდეს,როგორიც წარმოგვიდგენია. მე და ნიკა წავედით სოფელში მის ოჯახთან. ერთი ჩვეულებრივი დღე იყო როცა დილის 5 საათზე გავიღვიძე და მამამის გავყევით საქმეებზე. შეიძლება დიდად ვერაფერში დავეხმარე, მაგრამ დღემდე ძალიან მიხარია და ძალიან კარგად მახსენდება ეს ყველაფერი. გამიხარდა ნიკას ოჯახის გაცნობა. მე და ნიკას ბებოს ნასაუბრები გვქონდა,რომ გოგოებს რო გავიცნობთ,პირველი ჩემთან მოიყვანთ ქასთინგზე შესამოწმებლადო. ალბათ უკვე წაიკითხეთ ჩემი და ერთი გოგოს ურთიერთობის მიმდინარეობა და დასრულება. ერთი ჩვეულებრივი დღე თენდება, დილით ვდგები ყავას ვსვამ და ვცდილობ შაბათ-კვირა დასვენებისთვის გამოვიყენო, მაგრამ ვინ გაცდის, ზარი შემოვიდა ნიკასგან და მითხრა სოფელში ავიდეთ ჩემთან ვიქეიფოთო. მოკლედ წავედით მანქანით მე ნიკა ჩვენი მეგობრები და ეს გოგო. დასრულდა ეს დღეც ძალიან კარგად და დიდი ხნის შემდეგ ვნახე ნიკას ბებო და რო ვსაუბრობდით და გაიგო,რომ ამ გოგოსთან დავასრულე ყველაფერი. “ისე რო მოიყვანე ეგრევე ვიფიქრე, რომ შენ უკეთესი შეგეფერებოდაო, მაგრამ არაფერი გითხარი რომ არგწყენოდაო”. ეს ყველაფერი როგორი მწარე რეალობაც არუნდა იყოს და როგორც არუნდა ჟღერდეს ასეა, ჩვენ ძალიან ბევრი ვიცინეთ და ისე გავაგრძელეთ ცხოვრება ვითომ არაფერი მომხდარა. ასევე ჩემი ოჯახის წევრებიც ნიკას ძალიან აფასებენ და უყვართ, სულ ყოველთვის აქვთ ნიკას იმედი და დარწმუნებული ვარ როგორც მე გამიხარდება ნიკას კარგი ამბის გაგება ანალოგიურად გაუხარდებათ. ჩვენმა ძმაკაცობამ ბევრი სხვადასხვა ადამიანი გამოიარა მაგრამ ერთმანეთი მაინც არ დავკარგეთ, რადგან სწორად და ადეკვატურად ვაანალიზებთ ყველა სიტუაციას. ნიკასთან ურთიერთობის პერიოდში ნიკას მხრიდანაც ბევრი ძალიან კარგი ადამიანი გავიცანი, ვისთანაც შემდგომში ურთიერთობა ჩამოვაყალიბე.მე და ნიკასთან ერთად ზღვაზე დეა და თაკო წამოვიდნენ,რომლებსაც საერთოდ არვიცნობდი. ძალიან შორიდან ვიცნობდი თაკოს და დეას პირველად შევხვდი წასვლის დღეს .გაცნობის დღიდან გულთან ახლოს მივიდნენ და საბოლოოდ ერთი სამეგობრო წრე შეიკრა, რომლებზეც სულ საუბრობენ.ვციტირებ `სთორებს ვნახულობ და ძალიან მიხარია,რომ ასეთი სამეგობრო ხართ, სულ ერთად დადიხართ`` ეს საუბარი მეც ყოველთვის მახარებდა, თუმცა დრო გადის და ჩვენც უფრო მეტი პასუხისმგებლობა გვემატება ცხოვრებაში. ხშირია მომენტი, როდესაც ყველა თავის გზაზე მიდის ცხოვრებაში, დროის ნაკლებობა იჩენს თავს და ის შეხვედრები,გართობა და მოგონებებიც იკლებს. ამ შემთხვევაშიც ვფიქრობ,რომ ასე მოხდა. დეას სამსახურის გამო თითქმის საერთოდ ვეღარ ვნახულობ და ვეღარც ხშირად ვეკონტაქტები. დეა ძაან მიყვარს როგორ ადამიანი, მაგრამ შეიძლება ითქვას,რომ ისეთივე ურთიერთობა აღარ გვაქვს, რაც გვქონდა დასაწყისში.ასეთი ჩავარდნები ყოველთვის არის ურთიერთობებში,მაგრამ ჩემთვის ყოველთვის მთავარი ის არის,რომ ძალიან დიდი ბედნიერებით ვნახულობ ამ ადამიანს ყველა შეხვედრაზე.ძალიან მიზან დასახული და შრომისმოყვარე ადამიანი არის, პირიქით მიხარია,რომ საკუთარი მიზნების ასრულებისთვის ამდენს შრომობს.არასდროს დავადანაშაულებ ვინმეს იმის გამო,რომ შრომა არჩია გართობას.ჩანახატის წერა,რომ დავიწყე მაგდროს მაქვს დაწერილი, ახლა გასულია საკმაოდ დიდი დრო უბრალოდ ვამატებ ხოლმე და საერთოდ სხვა დამოკიდებულება მაქვს ყველაფერზე. ჩემებს ძალიან უყვართ დეა, დედაჩემი სულ ყოველთვის მეკითხება დეაზე ახალ ამბებს.ისე გამოვიდა, რომ უფრო ხშირად თაკო გვნახულობდა,რამაც გამოიწვია ის,რომ დაგვიახლოვდა მე და ნიკას ძალიან. არქონდა მნიშვნელობა სად მივდიოდით, იცოდა,რომ ჩვენთან დაცულად იყო და ყველგან ჩვენთან ერთად მოდიოდა, მაგრამ გავიდა დრო გათხოვდა და ისე მოხდა,რომ ქვეყნიდან წავიდა. კონტაქტი ყოველთვის გვაქვს, მაგრამ ადამიანი დისტანციური ურთიერთობის დროს მაინც სხვანაირად გრძნობ თავს.

        </p>
      }
      {
        <p className={styles.Friends_description}>
          ყოველთვის ვიძახი, რომ არაქვს მნიშვნელობა ადამიანს რამდენი ხანია იცნობ, ურთიერთობა ყოველთვის გაჩვენებს რა ეტაპზე ხართ, ზუსტად ამის დამადასტურებელი ფაქტია, მე და გიოს ურთიერთობა. 3 წელი გახდება რაც ერთმანეთს ვიცნობთ,თუმცა მოვახერხეთ და ამ 3 წელში იმდენი ტკბილი მოგონება შევქმენით და იმდენად კარგად განვავითარეთ ურთიერთობა, რომ ბევრი ადამიანი რამოდენიმე წლის განმავლობაში ვერ ახერხებს. ამით იმას ვამბობ, რომ ზუსტად ვიცი ძმაკაცობის მნიშვნელობა და გვერდით ის ადამიანები მყავს, ვისაც რეალურად ძმაკაცს ან მეგობარს ვეძახი. ის მომენტიც არის, რომ ჩემზე დიდი არის ასაკით გიო,რაც იმას ნიშნავს,რომ ჩემზე მეტი გამოცდილება აქვს გარკვეულ საკითხებში. სწორედ ამიტომ ყოველთვის მიხარია გიოსთან საუბარი სხვადასხვა თემებზე, არ აქვს მნიშვნელობა პირად ურთიერთობაზე იქნება საუბარი თუ უბრალოდ მომავლის გეგმებზე. დარწმუნებული ვარ,რომ გიოსგან ისეთ რჩევას მივიღებ,რომელსაც აუცილებლად გამოვიყენებ.გიო,რომ გავიცანი იმ პერიოდში არ იყო ჩემთვის კარგი დრო, რადგან საკუთარი თავი დაკარგული მეგონა და სულ ვცდილობდი,რომ გართობით და დალევით ყურადღება გადამეტანა სხვა რამეზე. ვფიქრობდი,რომ ეს ყველაფერი დამეხმარებოდა, თუმცა დიდი ხნის შემდეგ დავფიქრდი და მივხვდი,რომ უბრალოდ საკუთარ თავს ვაძლევდი იმდენის უფლებას,რომ ეს ეფიქრა და რეალურად არაფრის გამოსწორებას არვცდილობდი. მაგრამ ამის მიუხედავად გიოსთან ურთიერთობა მაინც კარგად ავაწყე. ვერ ჩამოვთვლი რამდენი მოგონება გვაქვს ერთად, რადგან ერთნაირი ადამიანები ვართ, შეიძლება 2 წამში მოვიფიქროთ, რამე სიგიჟე და გავაკეთოთ. გაგვიკეთებია კიდეც და ამ ყველაფრის გამო ვერ ვთვლი. რა თქმა უნდა ამ ყველაფრით არაფერი სრულდება და კიდევ ძალიან ბევრ ლამაზ და საინტერესო ტკბილ მოგონებას შევქმნით ერთად.
არშემიძლია არდავამატო თეო ძალიან მაგარი ადამიანი,რომელიც ასაკით ჩემზე დიდია,თუმცა არასდროს მიგრძვნია თავი პატარად თეოსთან,ერთად ვერთობით ჩვენი დიდი სამეგობრო და ეგ მახარებს,რომ ყველა ერთი ჭკუის ვართ.ერთ-ერთი საუკეთესო მოგონება,რომელიც აუცილებლად მთელი ცხოვრება გაგვყვება ყველას არის გიოს და თეოს ხელის თხოვნა, ამ ყველაფრის დაგეგმვაში მთელ სამეგობროს მიგვიძღვის წვლილი, უემოციურესი დღე იყო. ზოგადად ყველამ იცის,რომ ემოციური ვარ და არ მივეკუთვნები იმ საზოგადოებას "ბიჭები არ ტირიან ძმა"-ს,რომ გაიძახიან.ძალიან დიდ პატივს ვცემ თეოს და ყოველთვის მიხარია,რომ ჩვენს გვერდში არის. ძალიან კეთილი ადამიანი და საყვარელი ადამიანი, მიხარია,რომ ჩემს ძმაკაცს ასეთი მეორე ნახევარი ჰყავს და დღეს უკვე ერთი დიდი ოჯახი არის.
არ გამომრჩება ხურო, რომელიც წივილასგან და ნიკასგან გავიცანი. ამ ადამიანისგან პირველივე შეხვედრისას იმხელა სითბო და სიყვარული ვიგრძენი,რომ დარწმუნებული ვიყავი გავუგებდით ერთმანეთს და ასეც მოხდა. გარკვეული დროის შემდეგ ძმაკაცური ურთიერთობა ჩამოგვიყალიბდა და დღესდღეობით ძალიან ბევრ მოგონებას ვქმნით ერთად. ძალიან მაგარი გულის პატრონია ხურო და დარწმუნებით შემიძლია ვთქა,რომ მისი იმედი ნებისმიერ შემთხვევაში მექნება და თვითონაც ეგრე უნდა იყოს ჩემს მიმართ.რაც უფრო მეტი დრო გადის ზოგადად უფრო მეტს ვიგებთ ადამიანები ერთმანეთის შესახებ. ყველას გვაქვს გარკვეული სახის პრობლემები ცხოვრებაში. ხუროსაც ისეთივე ხასიათი აქვს,როგორც მე. რაც არუნდა ცუდი რამ ხდებოდეს ჩვენს თავს, არგამოვხატავთ ამ ყველაფერს და ვცდილობთ,რომ მეგობრებთან დროის გატარებით ყველაფერი დავაბალანსოთ. ბოლო პერიოდში ხშირად გვიწევს საუბარი მე და ხუროს, უმეტესად ერთი და იმავე სტილის პრობლემები გვაქვს. უკეთესი მომავლისკენ სწრაფვა და ხელის შემშლელი ფაქტორები, თუმცა არვნებდებით არცერთი. ძალიან მაგარი ადამიანი არის კიდევ ერთხელ ავღნიშნავ, ყოველთვის მიხარია ნიკასთან ერთად გასვლა, ასევე არ შემიძლია არ დავამატო ნიკას შეყვარებული მარიამი. ვერ გეტყვით,რომ ძალიან კარგად ვიცნობ,თუმცა ადამიანს პირველივე შეხვედრისასვე ეტყობა როგორი არის,თვისებების ჩამოთვლას არ დავიწყებ იმიტომ,რომ ძალიან ხშირად მომიწევს ერთი და იმავე სიტყვების გამოყენება.ძალიან მიხარია,რომ ერთმანეთი ჰყავთ და ორივემ მინდა იცოდეს,რომ ნებისმიერ სიტუაციაში და ნებისმიერ დროს შეუძლიათ ჩემი იმედი ქონდეთ.  Ჩემთვის ერთ-ერთი საუკეთესო შეგრძენა არის ის,რომ მამაჩემი გიჟდება ჩემს ძმაკაცებზე და ძაან უხარია,რომ ასეთ მაგარ ადამიანებთან ვძმაკაცობ. აქ მარტო ხუროზე არ არის საუბარი. ყველა ჩემს გარშემომყოფ ადამიანზე.გოგოებზე ბევრი არმისაუბრია, თუმცა დარწმუნებულები არიან,რომ მათთან ერთად დროის გატარება ძალაინ მიყვარს. თეო თიკუნა ნინო და მარი ჩვენი სამეგობროს განუყოფელი ნაწილი. Სადაც არუნდა ვიყოთ გვერდს გვიმშვენებენ და გვილამაზებენ დღეს. 
        </p>
      }
      {
        <p className={styles.Friends_description}>
ზოგადად ძალიან მიხარია,რომ ჩემი ძმაკაცები ერთმანეთს იცნობენ და ძაან კარგი ურთიერთობა აქვთ ერთმანეთთან. ასევე იგივე ხდება,როცა ისინი მაცნობენ თავიანთ ძმაკაცებს. Სწორედ ეს მოხდა ჩვენ შემთხვევაშიც, ერთმანეთს გავაცანით ახლო სამეგობრო და ძალიან დავახლოვდით ყველა ერთმანეთთან. Წივილას ბავშვობის მეგობრები გავიცანი და საკმაოდ კარგი ურთიერთობა ჩამოგვიყალიბდა. დადუ და ტაბატა ორი უმაგრესი კაცი. არ არის დიდი დრო გასული, რაც ეს ბიჭები გავიცანი,თუმცა ამ პერიოდში მოვახერხეთ, რომ უფრო განვითარებულიყო ჩვენი ურთიერთობა.ასეთი ადამიანების გაცნობა ყოველთვის სასიამოვნო მომენტია. Სხვათაშორის უკვე მოვახერხეთ საკმაოდ კარგი მოგონებების შექმნა და აუცილებლად გავაგრძელებთ ამ ყველაფერს. დადუს მეორე ნახევარს არ გამოვტოვებ რა თქმა უნდა. Ძალიან კარგი შთაბეჭდილება დამიტოვა ამ ადამიანმა,ბევრი არმისაუბრია ანუკისთან,თუმცა საკმაოდ საინტერესო ადამიანი ჩანს. მიხარია,რომ ეს ორი ადამიანი ერთად არიან. ასაკით ჩემზე დიდები არიან დადუ და ტაბატა, რაც იმას ნიშნავს,რომ გარკვეულ საკითხებში ჩემზე მეტი გამოცდილება აქვთ და მიხარია მათთან საუბარი სხვადასხვა თემებზე. ვიცი,რომ მათი გამოცდილებიდან შეიძლება რაიმე რჩევა მომცენ. ჯერ არგვქონია ასეთი სახის დიალოგი, თუმცა დარწმუნებული ვარ ჩემს გვერდით იქნებიან ეგეთ მომენტში. ანალოგიურად ვარ განწყობილი მეც ნებისმიერ საკითხში ამ ადამიანების გვერდით ვიქნები, არ აქვს მნიშვნელობა ასაკით პატარა ვარ თუარა.


        </p>
      }
    </div>,
    <div key={2} className={styles.Friends_Per}>
      <h2>თავი 2</h2>
      {
        <p className={styles.Friends_description}>
          ასევე ძალიან საინტერესო არის ის ფაქტი,რომ მე და სერგო 4 წელი იწყება უკვე რაც ვიცნობთ ერთმანეთს,თუმცა ის ურთიერთობა არასდროს გვქონია,რაც 2022 წელს ჩამოვაყალიბეთ, ეს ყველაფერი განპირობებული იყო იქიდან,რომ ერთნაირ სიტუაციებში ვიყავით და თითქმის ერთნაირი პრობლემები გვქონდა და თითქმის ყოველთვის ეგრე არის ხოლმე. ამავდროულად თემქაზე დიდი სამეგობრო გვყავდა,რომლებიც ნელნელა ცოტავდებოდა და საბოლოოდ მე და სერგო დავრჩით. რა თქმა უნდა მაქვს გარკვეული სახის ურთიერთობა მათთანაც, მაგრამ ასეთი ძმაკაცური ურთიერთობა, მხოლოდ სერგოსთან შევინარჩუნე. ძალიან ხშირად გვქონია მომენტი,როდესაც უბრალოდ საუბარი უნდოდა სერგოს და გავსულვართ გარეთ. ეს საუბარი გაგრძელებულა ღამის 3-4 საათამდე და ამ დროს ძალიან ბევრი თემა განხილულა ჩვენს თავებზე რა თქმა უნდა. რჩევები საკუთარი გამოცდილებიდან, თუ ის გამოცდილება არგვქონია რაზეც ვსაუბრობდით, მაშინ ამ სიტუაციაში ჩვენ, როგორ მოვიქცეოდით. ყოფილა მომენტი,როცა უბრალოდ არაფერი არგვინდოდა ყველაფრით დაღლილები ვყოფილვართ და მანქანაში მარტო მე და სერგოს დაგვილევია ლუდები და იმ დროსაც ძალიან ბევრი გვისაუბრია ჩვენს გარშემო დატრიალებულ ამბებზე, რადგან დღევანდელისგან განსხვავებით იმ დროს რთულად აღვიქვამდი ადამიანების წასვლას ჩემი ცხოვრებიდან, რაც საბოლოოდ მე მტკენდა გულს და ცუდად აისახებოდა ჩემს პიროვნებაზე. დიდი ხნის შემდეგ გადავწყვიტეთ,რომ ახალ სფეროში გამოგვეცადა თავი და დეველოპერობა დავიწყეთ. მე მანამდე მქონდა გამოცდილება ჩემით ვსწავლობდი, თუმცა სერგომ მეც დავიწყებ კურსებს და ერთად ვიაროთო. ძალიან გამიხარდა ეს ყველაფერი, რადგან უფრო მოტივირებული ვიყავი და თან ის მომენტი მქონდა,რომ რაიმეს თუ ვერ გავიგებდით შემდეგ ერთმანეთს ავუხსნიდით და უფრო კარგად გავიაზრებდით,თუმცა მოხდა ისე,რომ სერგომ თავის თავი უფრო დიზაინერობაში იპოვნა,ვიდრე დეველოპერობაში. მანდ გაიყო ჩვენი გზები, მაგრამ არცერთი დავნებდით და ისევ ისეთი შემართებით გავაგრძელეთ სწავლა, როგორი შემართებითაც დავიწყეთ ეს ყველაფერი. ბევრი მოგონება მაქვს სერგოსთან ერთად, რომლებიც ძალიან კარგად გვახსენდება და ამავდროულად გვაქვს ისეთი მოგონებები,რომლებიც არც ისე კარგი იყო, თუმცა დღეს სიცილით ვიხსენებთ.ნინო,რომელიც გაცნობის დღიდან დადებით შთაბეჭდილებას მიტოვებდა და უფრო ახლოდან გაცნობით მივხვდი, რომ ჩემი შთაბეჭდილება ამ გოგოზე ზუსტი იყო. ადამიანი,რომელიც სულ მზად არის,რომ მოგისმინოს.ასევე ძალიან დიდი მოგონებები მაკავშირებს,სერგოს მამიდაშვილებთან ხატიასთან და მარიამთან,ამ ორმა ადამიანმა იმდენი შეძლო,რომ 2022 წელს უამრავი მოგონება შექმნეს ჩემთან ერთად,ძალიან მიყვარს ორივე,არგამოვარჩევ არცერთს,თუმცა მგონია,რომ მარიამის და ჩემი ხასიათი ზუსტად ემთხვევა ერმანეთს და ეს უფრო გვაახლოვებს.

        </p>
      }
      {
        <p className={styles.Friends_description}>
          რაც შეეხება გეგოს და რუსოს. რუსოს მეხუთე წელია ვიცნობ და თავიდანვე ვიცოდი რო უსაყვარლესი გოგო იყო, თუმცა ვერ წარმოვიდგენდი,რომ შეიძლებოდა გეგო და რუსო ერთად ყოფილიყვნენ რამოდენიმე წელში. გეგოზე ბევრს ვერ ვისაუბრებ იმიტომ,რომ ძალიან ბევრის ლაპარაკი შემიძლია და ჩანახატი არეყოფა. გეგო არის ადამიანი, რომელმაც ჩემი აზრით ყველაზე მეტი იცის ჩემს შესახებ. არც გეგოსთან ვსაუბრობ ხოლმე ძალიან ბევრს, მაგრამ მაინც ყველაზე მეტი იცის, თვალებითაც კი შეუძლია მიხვდეს, რას ვაპირებ იმ მომენტში. დრო გავიდა და გავიზარდეთ სამივე. იმდენად ხშირი კონტაქტი აღარ მაქვს მათთან, თუმცა ეს არნიშნავს იმას,რომ ან რაიმე შეიცვალა ჩვენს ურთიერთობაში და ცუდად ვარ განწყობილი. პირიქით ვგიჟდები ორივეზე ისე მიყვარს, ძალიან ბევრი საინტერესო მოგონება გამაჩნია ამ ადამიანებთან,ცალკეულად გეგოს რაც შეეხება, მთელი ბავშვობა ერთად მოვდივართ და დღემდე ერთად ვართ. ამიტომ როგორც არუნდა ჟღერდეს. მთელი ჩემი ცხოვრება, რომელიც გეგოსთან ერთად გავატარე ძალიან ტკბილი მოგონებაა. საუკეთესო პერიოდი მაინც უკვე მოზრდილ ასაკში მქონდა, როდესაც გეგოსთან ერთად დავიწყე მუშაობა,რადგან ყოველდღე ერთმანეთს ვხვდებოდით, თუმცა ეს ყველაფერი სამსახურზე არ აისახებოდა. სამსახურში ვიყავით უბრალოდ თანამშრომლები და სამსახურის გარეთ ძმაკაცები და ბიძაშვილები. ამ პერიოდში რუსოსაც ხშირად ვნახულობდით ხოლმე, უბრალოდ მე, როგორც ყოველთვის მარტოხელა ძმაკაცი ვიყავი,რომელიც შეყვარებულ წყვილს რომანტიულ საღამოს უფუჭებს. მაგრამ ამ ყველაფრის მიუხედავად ყოველთვის უხაროდათ ჩემი გასვლა მათთან ერთად. ზამთრის პერიოდი იყო,როცა გეგო რუსო, რუსოს დიდი დაიკო და მისი შეყვარებული აპირებდნენ ბაკურიანში წასვლას, უბრალოდ ხუმრობით ვუთხარი მეც წამიყვანეთთქო, მოახლოვდა უკვე წასვლის დრო და გეგომ დამირეკა ხოარ გადაიფიქრე წამოსვლაო.ბოლომდე ხუმრობა მეგონა,მაგრამ რა თქმა უნდა წავედი და ძალიან სასიამოვნო დროც გავატარეთ. ამ შემთხვევაში უარესად ეული გამოვჩნდი ორ წყვილს შორის მარტო ვიყავი. მაგრამ უმაგრესი იყო და ამაზე კარგი მოგონება ალბათ არშეგვიქმნია. ცოტას გეგოს შესახებ მოვყვები ეს არის ადამიანი, რომელთან ერთადაც გავიზარდე და ძალიან კარგად ვიცნობთ ერთმანეთს. ზუსტად ვიცით ერთმანეთის ხასიათი. ყოველთვის ვგრძნობდი გეგოს მშობლებისგან ანუ ბიძაჩემი და ბიცოლაჩემისგან, რომ ძალიან ვუყვარდი და ანალოგიურად ვარ დღემდე. ჩემი მხრიდანაც ძალიან დიდი სიყვარული არის ამ ადამიანების მიმართ.ზოგადად გამოხატვა არ შემიძლია,რაც არმომწონს, თუმცა ვცდილობ ხოლმე,რომ როგორც შემიძლია ისე გამოვხატო ეს სიყვარული, მხოლოდ სიტყვები არაფერს ნიშნავს, როგორც შემიძლია ხოლმე ქმედებით და სიტყვებით გამოვხატავ. იმის მიუხედავად,რომ ორივე ძალიან მიყვარს ბიცოლაჩემთან უფრო გახსნილი ვარ და უფრო არმიჭირს იმის გამოხატვა, თუ რამდენს ნიშნავს ჩემთვის და რამდენად ძვირფასია. ბიძაჩემზეც ანალოგიურად ვარ რა თქმა უნდა ძალიან მიყვარს და ვაფასებ, უბრალოდ ამ ყველაფერს ვერ გადავცემ ისე როგორც საჭიროა. მე და გეგოს გარდა ჩვენი მშობლების დამსახურებაა, რომ დღესდღეობით ასეთი ურთიერთობა გვაქვს და ვფიქრობ,რომ ეს ყველაფერი კიდევ ძალიან დიდხანს გაგრძელდება
        </p>
      }
      {
        <p className={styles.Friends_description}>
          არანაირად არ გამომრჩება ადამიანი,რომელიც სრულიად შემთხვევით გამოჩნდა ჩემს ცხოვრებაში,თუმცა დღემდე ძალიან ახლოს არის ჩემთან და გულში მყავს ეს ადამიანი.ნინი გოგატიშვილი,რომელზეც შემიძლია ძალიან ბევრი გესაუბროთ.ადამიანია,რომელსაც 5 წელია ვიცნობ და თითქმის ყველაფერს ვუზიარებთ ერთმანეთს, ხშირ კონტაქტს ვერც ნინისთან ვახერხებ,მაგრამ ძალიან ვაფასებ,პირველ რიგში,როგორც ადამიანს და შემდეგ,როგორც მეგობარს.ეს ადამიანი გავიცანი აბიტურიენტობის დროს ჩემზე პატარა არის ასაკით, მაგრამ იმდენად კარგი მსმენელი და მრჩეველია, რომ ვერ იგრძნობ ასაკის სხვაობას, ძალიან მიყვარს ყველა მოგონება მასთან დაკავშირებული. თავიდან ძალიან შებოჭილები ვიყავით ურთიერთობაში თან პატარები ვიყავით, რაც უფრო გავიზარდეთ უფრო მეტ რამეს ვუყვებით ერთმანეთს და გვერდში ვუდგავართ, ეს ადამიანი არის ელენე ფირანიშვილი.ყოველთვის გვიხარია ერთმანეთის ნახვა,მიწერა, საუბარი და ასე შემდეგ.ხშირად არის მომენტი,როდესაც მამჩნევს ცუდ ხასიათს და წამიერად იცვლება ჩვენი მიმოწერა.იწყებს ჩხუბს იმ საკითხთან დაკავშირებით,რომ მგონი გარკვეული სახის პრობლემები გაქვს და არმიყვები და უნდა გნახო აუცილებლად.ძალიან ბევრი საინტერესო მოგონება გვაქვს ერთად ერთ-ერთი საუკეთესო მოგონება ალბათ ვინი ვიცის კონცერტზე წასვლა იყო, სადაც ანუკიც იყო.შეიძლება გაგიჩნდეთ კითხვა,თუ ვინ არის ანუკი ამას ცოტახანში გაიგებთ. საერთოდ შეგვეცვალა გემოვნება ყველას და აღარ ვუსმენთ ვინი ვიცს, მაგრამ კონცერტი დაგვეხმარა,რომ უფრო მეტად თავისუფლად ვყოფილიყავით ერთმანეთთან.რაც უფრო ვიზრდებით უფრო მეტი პასუხისმგებლობები გვემატება ცხოვრებაში და დროსაც ძალიან ბევრს ვხარჯავთ,სწორედ ამიტომ იმ სიხშირით ვეღარ ვნახულობთ ერთმანეთს,თუმცა ერთმანეთის ამბებს მაინც ვიგებთ და რა თქმა უნდა ძალიან გვახარებს ერთმანეთის კარგი ამბავი. ყოველთვის მზად ვარ,რომ გვერდში დავუდგე და დავეხმარო ნებისმიერ საკითხში. უკვე ვახსენე ანუკი,რომლის გაცნობაზეც დღემდე მეცინება. ერთი ჩვეულებრივი დღე არის და ინსტაგრამზე მაფოლოვებს ძალიან ლამაზი ქერა გოგო, ვაა მეთქი მურო მორცხვობა გვერდით გადადე და მიწერე. რა თქმა უნდა გადავდგი ეს ნაბიჯი დავიწყეთ საუბარი, თუმცა ჩვენი ქალაქი ხო ძალიან პატარაა, ყველგან ნაცნობს ვპოულობთ. ელენე მიგდებს ანუკის ფოტოს ინსტაგრამზე,მეთქი რახდება ანუკის აქ რაუნდა. ეს რა თქმა უნდა ხუმრობით, ძალიან გამიხარდა ის ფაქტი,რომ ერთმანეთს იცნობდნენ და დაქალობდნენ,რადგან ეგ ყველაფერი გახდა იმის მიზეზი,რომ ანუკისთანაც ძალიან კარგი ურთიერთობა ჩამომიყალიბდა. არ აქვს მნიშვნელობა რამდენად ხშირად ვნახულობთ ერთმანეთს.პირველ რიგში ჩვენი დაახლოვების მიზეზი გახდა ის ფაქტი,რომ ერთნაირი ინტერესები გვაქვს ძალიან ძალიან ბევრი. შეიძლება ყოველდღე არვნახულობთ ერთმანეთს და არც ყოველდღიური კონტაქტი გვაქვს ერთმანეთთან, თუმცა ეს არასდროს გამხდარა იმის მიზეზი,რომ ურთიერთობა გაგვეწყვიტა ან რაიმე მსგავსი.


        </p>
      }
      {
        <p className={styles.Friends_description}>
          ანუკიმ შემომთავაზა ბანაკში წასვლა და რა თქმა უნდა დავთანხმდი, რადგან
          ზოგადად ყოველთვის ვცდილობ ახალი გამოწვევები მივიღო და საკუთარი თავის
          განვითარებისკენ კიდევ ერთი ნაბიჯი გადავდგა. ჯერ მეორე დღეა რაც აქვარ
          და უკვე მაქვს გარკვეული შთაბეჭდილება ყველასთან დაკავშირებით. არვიცი
          როგორ გაგრძელდება ყველაფერი, თუმცა მე ჩემს მაქსიმუმს ვეცდები,რომ
          ბავშვებს კარგად დავამახსოვრდე, რადგან ჩემთვის უსაყვარლესი ადამიანები
          გახდნენ. ამ გადაწყვეტილებას არასდროს არ ვინანებ,რადგან როგორც
          კარიერულად მივიღებ სხვა სფეროში გამოცდილებას,ასევე ბავშვებთან მექნება
          ასეთი სახის ურთიერთობა,როდესაც მასწავლებლის როლს ვირგებ. მესამე დღე
          არის,რაც ბანაკში ვარ ამ კარგ ადამიანებთან ერთად, ნელნელა უფრო
          ვუახლოვდები აქ მყოფ მასწავლებლებს, ხელმძღვანელს და მოკლედ სტაფის
          წევრებს. ეს ყველაფერი ძალიან მახარებს,რადგან უკვე ბევრი საინტერესო რამ
          გადაგვხდა თავს. საინტერესო ფაქტებთან და ამ სიხარულთან ერთად,
          ვგრძნობ,რომ ძალიან დიდი პასუხისმგებლობა მაქვს აღებული ამ ბავშვების
          მიმართ. ყოველთვის ვცდილობ,რომ ნაცნობობა არ გამოვიყენო და საკუთარი
          თავის მაქსიმუმი გავაკეთო და დავამტკიცო,რომ ვიმსახურებ ამა თუ იმ
          პოზიციაზე ყოფნას. ძალიან დიდ პატივს ვცემ ხელმძღვანელს და მინდა,რომ
          მისი იმედები გავამართლო. დღევანდელი გადმოსახედიდან,რომ ვიმსჯელო
          შეიძლება ვერ გამომივიდა საკუთარი თავის საუკეთესო ვერსიად ყოფნა,
          ზოგადად არასდროს ვიღებ შენიშვნას ცუდად,რადგან ვხვდები,რომ რაიმე
          შეცდომა დავუშვი. რა თქმა უნდა შეცდომები ყველას მოგვდის და სწორედ
          ამიტომ ძალიან სწორად აღვიქვი მარიამსი ნათქვამი. სწორიც არის რეალურად
          ყოველთვის ვცდილობდი,რომ ძაან მკაცრი არ გამოვჩენილიყავი
          ბავშვებთან,მაგრამ დღეს მივხვდი,რომ ძალიან ცუდად გამოიყენებდნენ ამ
          ყველაფერს ამიტომ წინა დღეებთან შედარებით თითქმის ყველას გავაკეთებინე
          აზიდვები ბუქნები და მოკლედ ჩვეულებრივი დასჯა. იმედი მაქვს ცოტა ცუდი
          ნათქვამია, დარწმუნებული ვარ,რომ ხვალიდან ყველაფერს შევეცდები,რომ ყველა
          აქ მყოფი სტაფს ვაჩვენო ჩემი შესაძლებლობები.
        </p>
      }
      {
        <p className={styles.Friends_description}>
          რაც შეეხება ბავშვებს აი არვიცი საიდან დავიწყო ზოგადად ძალიან მიყვარს
          ბავშვებთან კონტაქტი, მაგრამ არასდროს არმქონია ასეთი სახის ურთიერთობა
          მათთან და ვფიქრობ,რომ ერთ-ერთი ყველაზე კარგი გამოცდილება ჩემს
          ცხოვრებაში. უსაყვარლესი და უჭკვიანესი ახალგაზრდები არიან,რომლებსაც
          ძალიან ძალიან დიდი მომავალი აქვთ დარწმუნებული ვარ, მთავარია საკუთარ
          თავში იპოვნონ მოტივაცია,რომელიც შემდგომ დისციპლინაში გადაუვათ და
          შეეცდებიან რომ საკუთარ თავზე ბევრი იმუშაონ და განავითარონ საკუთარი
          თავები. შობის დღესასწაულიც რა თქმა უნდა ბანაკში გავატარეთ ყველამ
          ერთად.ძალიან დამღლელი,მაგრამ ამავდროულად ბევრი კარგი მოგონების შექმნის
          დღე იყო. ცხოვრებაში პირველად ვცადე ციგურებზე დადგომა და სიმართლე,რომ
          ვთქვა ამ კონკრეტულ პერიოდში, არც თუ ისე სასიამოვნოდ მეჩვენება ეს
          ფაქტი,რადგან საკმაოდ რთული აღმოჩნდა სწავლის პროცესი. ვერ ვთვლი
          რამდენჯერ წავიქეცი მოედანზე,მაგრამ ეს ყველაფერიც ძალიან მაბედნიერებს,
          იმის მიუხედავად,რომ ძაან დამცინეს მათ სახეზე ღიმილმა გამახარა.ყველანი
          უსაყვარლესად ცდილობდნენ ჩემთვის ესწავლათ ციგურებით სრიალი.საღამოს მე
          და ერთერთ თანამშრომელს დაგვევალა კოცონის მომზადება საღამოსთვის.
          საკმაოდ საინტერესო საღამო გამოვიდა,სადაც ნებისმიერ ადამიანს შეეძლო
          განტვირთვა. ამ ყველაფრით შობის დღე არ დაგვისრულებია, სასტუმროში
          შემოსვლის დროს დაიწყეს სიმღერა,რასაც მეორე სიმღერა მოჰყვა და ასე
          ექსტრა ფართი გამოგვივიდა. ამის შემდეთ სტაფის წევრებმა გავცვალეთ სეკრეტ
          სანტას საჩუქრები. აზრი იდო იმაში,რომ ჩვენით უნდა შეგვექმნა ყველაფერი.
          ამომივიდა ჰანა,ვისთანაც არმქონია აქამდე კონტაქტი,მაგრამ ბავშვების
          დახმარებით გავარკვიე მისი საყვარელი ფერი და სხვადასხვა ჰობი, ერთერთი
          მათგანი არის ბოულინგი და გადავწყვიტე მაგიდის თამაში, არაფერი
          განსაკუთრებული,მაგრამ მთელი გულით შევეცადე კარგი გამოსულიყო. მე
          მაჩუქეს პლასტელინით გამოძერწილი ფანდური,რამაც ძალიან გამახარა.
          შეიძლება იფიქროთ,თუ რატომ გამიხარდა პლასტენილით გაკეთებული ნივთი,
          თუმცა როგორც ჩემი ჩანახატებიდან უკვე იცით ვარ ადამიანი ,რომელსაც
          შეუძლიაა ძალიან ბევრი რამ დაიმახსოვროს და ასეთი მცირე საჩუქრებით
          მიიღოს ბედნიერება. ამ შემთხვევაში სეკრეტ სანტას გამო ვსაუბრობ
          საჩუქარზე,თორე საერთოდ არ აქვს ჩემთვის მნიშვნელობა.
        </p>
      }
    </div>,
    <div key={3} className={styles.Friends_Per}>
      <h2>თავი 3</h2>
      {
        <p className={styles.Friends_description}>
          არიან კიდე ჩემს ცხოვრებაში მნიშვნელოვანი ადამიანები,უბრალოდ ასე ისტორიებით ვერ მოვყვები ყველას შესახებ. სხვათაშორის დასაწყისში ტურებზე მქონდა საუბარი. თუმცა არვახსენე ის ხალხი, რომლებმაც მიმიღეს და შეიძლება ითქვას, რომ ერთერთი ოჯახის წევრი გავხდი. კონკრეტულ სახელებს არვიტყვი, თუვინმე წაიკითხავს ამ ჩანახატს ისედაც ნათელი იქნება ვისაც ეხება. არმინდა,რომ ვინმე გამომრჩეს და ამიტომ არავის ეწყინება იმედია,უბრალოდ ყველასთან არმაქვს ბევრი მოგონება, თუმცა მცირე მოგონებაც საკმარისი გახდა,რომ ამ ადმიანებთან გარკვეული სახის ურთიერთობა ჩამომეყალიბებინა,რომელიც დროსთან ერთად განვითარდებოდა.თუმცა მაინც უნდა ვთქვა სახელები.პაპაშა ადამიანი,რომელთანაც უკარგესი ურთიერთობა ჩამოვაყალიბე და ძალიან კარგად გრძელდება,ამ ადამიანის გული,რომ დავინახე და ანალოგიურად მან ჩემი დაინახა მაგიტომ ავაწყეთ ასეთი კარგი ურთიერთობა,თავისუფლად შემიძლია ძმაკაცი დავუძახო ამ ადამიანს,რადგან ვგრძნობ იმ ურთიერთობას,რაც ძმაკაცობისთვის საჭიროა.ზოგადად არვეძახი ბევრ ადამიანს ძმაკაცს, სხვათაშორის ბოლო მომენტში უფრო გახსნილად და ბევრს ვსაუბრობთ და მიხარია ძალიან.ბოლო საუბარი ძალიან სიღრმისეული და საინტერესო იყო, რასაც ვფიქრობდი და საკუთარ თავთან მქონდა მხოლოდ საუბრები პაპაშასთან ლაპარაკმა ეგ ფიქრები უფრო გამიღრმავა და მოვახერხეთ ერთად,რომ ოვერსინქინგი დასრულებულიყო.ძალიან ახლოს ვარ ამ ადამიანთან და ყველაზე მეტად ის მახარებს,რომ ისტორიის შელამაზება არმიწევს და სხვანაირად მოყოლა.რაც ხდება ზუსტად ისე ვყვებით,ხოლმე ერთმანეთთან. მიხარია ამ ადამიანის გაცნობა. შეიძლება ითქვას,რომ ორივესთვის საკმაოდ რთულ პერიოდში გამოვჩნდით ერთმანეთის ცხოვრებაში. დიდი ალბათობით ჩვენი დაახლოების ერთ-ერთი მთავარი მიზეზი ეგ არის,რომ არა მარტო რთული პერიოდები არამედ ძალიან ბევრი საერთო გვაქვს. ინტერესები, აზროვნება, საუბარი და კიდევ ბევრი. ხასიათებს ვერ ვიტყვი,რადგან ვფიქრობ ჩემზე ბევრად კარგი ხასიათი აქვს. იმის მიუხედავად,რომ თუ აფეთქდა მაშინ ძაან გიჟია, მაინც კარგად შეუძლია საკუთარი ემოციების და თავის კონტროლი. ჩემგან განსხვავებით, მე ადვილად ვღიზიანდები და მარტივად ვბრაზდები, თუმცა მეც ვცდილობ, რომ თავი შევიკავო და არ ავფეთქდე,რადგან ამ მომენტში ძალიან აფექტურად ვარ და შეიძლება ძალიან ცუდი,რამ გავაკეთო. მე და პაპაშას შორის ის მომენტი არყოფილა, რომ ერთმანეთისთქვის გვეთქვა ვიძმაკაცოთ ან რამე მსგავსი. ნელნელა დინებას მივყვებით და ზუსტად იქ ავღმოვჩნდით, სადაც ახლა ჩვენი ურთიერთობაა. ზაფხულში ოჯახთან ერთად იყო წასული ლაგოდეხში, მე არვიცნობდი მშობლებს  და შემრცხვა ჩასვლა, თუმცა სექტემბერში მხოლოდ ჩვენ ახალგაზრდები წავედით გიოს სოფელში. წასვლამდე გავიცანი ოჯახი და აი უბედნიერესი ვარ დღემდე,რადგან ძალიან მიყვარს პაპაშას ოჯახი და მეც შევუყვარდი ამ ადამიანებს. ლაგოდეხში იმის მიუხედავად,რომ 3 დღე ვიყავით ძალიან გავერთეთ და ძალიან დიდხანს გაგვყვება ეს მოგონება დარწმუნებული ვარ. მას შემდეგ მამამის ვესაუბრე,რომ თქვენთან ერთადაც აუცილებლად წამოვალ სოფელში, რადგან დარწმუნებული ვარ,რომ კარგად გავერთობით ყველა ერთადთქო.მართლა ძალიან გამიხარდა მისი ოჯახის გაცნობა, ნინიკო არის პაპაშას პატარა დაიკო,რომელზეც ვგიჟდები ისე მიყვარს. დარწმუნებული უნდა იყოს,რომ ნებისმიერ შემთხვევაში შეუძლია ჩემი იმედი ქონდეს.დედიკოზე საუბარი არმაქვს,ზოგადად უფრო მარტივად გამოვხატავ ემოციებს და სიყვარულს სოფოს მიმართ. მცირე მოგონებებით იმდენად დავახლოვდით მე და პაპაშა, რომ ადამიანს ოჯახში, რომ შემოუშვებ ის უკვე შენი ძმასავითაა. ჩემთან ხშირად დარჩენილა და ჩემებს ძაან უყვართ. მამაჩემი სულ მეუბნება მოიყვანე სახლში და გამაცანი ყველაო. შეიძლება მე და გიომ ერთი და იგივე თემაზე ვისაუბროთ ყველა შეხვედრაზე, მაგრამ ყოველთვის სხვადასხვა რამეს ვსაუბრობთ, იმდენად კარგად შეგვიძლია ერთმანეთთან საუბარი. არის სიტუაციები თან ძალიან ხშირი, როდესაც ისე ვიცინით ღამე სახლიდან გაგდებით გვემუქრებიან ორივეს. ძალიან თავისუფლად შეგვიძლია ყველაფერი ხუმრობაში გავატაროთ და ამავდროულად თუ საჭირო გახდა და მოთმენის უნარი იმ მომენტში დავკარგე იგივე ხუმრობის გამო ძალიან მწარედ ვაწყენინოთ ვინმეს. პაპაშას მხრიდან ძალიან კარგი ადამიანები გავიცანი და მეც გავაცანი ჩემი საძმაკაცო სამეგობრო და ძაან მიხარია ყველას ძალიან კარგი ურთიერთობა,რომ გვაქვს ერთმანეთთან. იცის გიომ,რომ ნებისმიერ დროს მზად ვარ გვერდში დავუდგე. ძალიან ბევრი ადამიანები ჩამოვიშორეთ და პირიქით მიხარია,რომ წამსვლელები წავიდნენ. ყოფილა ხშირად მომენტი,როცა სურდათ მე და გიოს შორის დაძაბულობა ყოფილიყო და ამის გამო ბევრი ტყუილიც მომისმენია. არვიცი ეს რის გამო შეიძლება ყოფილიყო. ჰგონებიათ, რომ მე და გიო ბავშვობის ძმაკაცები ვიყავით. 1წელი და 4 თვეა რაც ვიცნობ,მაგრამ ამ დროის მანძილზე მე და გიომ შევძელით,რომ ძალიან ახლოს ვყოფილიყავით ერთმანეთთან. წინ დიდი გზა გვაქვს, რასაც აუცილებლად ერთად გავივლით. დარწმუნებული ვარ, რომ ბევრი წინაღობა შეგვხვდება და 100%-ით მზად ვარ,რომ დავხვდე ამ გამოწვევას დავამარცხო და საბოლოოდ საკუთარი თავის საუკეთესო ვერსია გავხდე.

        </p>
      }
      {
        <p className={styles.Friends_description}>
          სხვათაშორის ბოლო დროს ძალიან შემცირდა იმ ადამიანების კატეგორია, ვისაც ვენდობი და ძმაკაცად ან მეგობრად აღვიქვამ, თუმცა პაპაშას მხრიდან გაცნობილმა ადამიანმა იმდენად კარგი შთაბეჭდილება დამიტოვა,რომ ძალიან დიდი სურვილი მქონდა უფრო ახლოდან გაგვეცნო ერთმანეთი. არ მგონია, რომ კარგ სიტუაციაში გამიცნო, მაგრამ დარწმუნებული ვარ ცუდი შთაბეჭდილება არ ექნებოდა ჩემზე. საუბარი მაქვს დიანა მახარაძეზე. აი მართლა ადამიანი არის,რომელიც ძალიან მცირე დროის წინ გავიცანი, თუმცა ვენდობი და სურვილი მაქვს, რომ უფრო დავახლოვდეთ. იცის,რომ ნებისმიერ მომენტში შეუძლია მენდოს და ნებისმიერ საკითხზე შემიძლია ვესაუბრო. არ გვაქვს მე და დიანას ბევრი მოგონება ერთად, თუმცა ჯერ ახალგაზრდები ვართ და წინ ძალიან დიდი გზაა, რასაც ერთად გავივლით და ძალიან ბევრ საინტერესო მოგონებას შევიქმნით. პირობა გვაქვს დადებული, რომ 2024-ის ბოლოს საერთოდ სხვა ფორმაში უნდა ვნახოთ ერთმანეთი და დარწმუნებული ვარ,რომ ყველა შევასრულებთ ამ პირობას. არ შემიძლია ბევრი საუბარი მოგონებებზე, თუმცა დიდი სურვილი მაქვს ჩემი შთაბეჭდილება გაგიზიაროთ ამ ადამიანთან დაკავშირებით. ძალიან ახლოდან არვიცნობ ჯერჯერობით, მაგრამ დიალოგი გვქონდა გარკვეულ საკითხთან დაკავშირებით და ძალიან მარტივად შემიძლია მივხვდე ადამიანი როგორი არის. მოკლედ რომ გითხრათ ეს ადამიანი მგონია, უკეთილშობილესი გოგო,რომელიც ყოველთვის მზად არის მოგისმინოს,დაგეხმაროს და გვერდში დაგიდგეს. მგონია ცოტა ცუდი ნათქვამია. დარწმუნებული ვარ,რომ ასეთი ადამიანი არის. ზუსტად ვიცი,რომ შრომისმოყვარე ადამიანი არის და დასახული მიზნის მიღწევისკენ ყოველთვის მიიწევს. საერთო შეიძლება მე და დიანამაც ბევრი გამოვნახოთ, მინიმუმ იმ ფაქტით,რომ წარსულის მეგობრები გაიფანტნენ ჩვენი ცხოვრებიდან. აუცილებლად მეტს გესაუბრებით დიანას შესახებ,როდესაც უკეთესად გავიცნობ. ამავდროულად გავიცანი ანა კარტოზია პაპაშას მხრიდან,რომელთანაც ძალიან კარგი ურთიერთობა ჩამომიყალიბდა. მიხარია,რომ ვიცნობ და ბევრი კარგი და ლამაზი მოგონება გვაქვს ერთად. უსაყვარლესი ადამიანი არის.ცოტა ემოციური, მაგრამ ეგ საჭიროა პირიქით. ყველას ცხოვრებაში არის რთული პერიოდი და ამას აუცილებლად მეგობრებთან ერთად გადავლახავთ. ანა ჩემთვის არის ერთ-ერთი ახლო მეგობარი,რომელთანაც ძალიან თავისუფლად ვგრძობ თავს და შებოჭილი არვარ. არმიწევს ისე მოვიქცე, როგორიც რეალურად არვარ. ვერასდროს ვერ მოვაჩვენებ თავს სხვა ადამიანად, რადგან არ არის ეგ ჩემი ძლიერი მხარე.

        </p>
      }
      {
        <p className={styles.Friends_description}>
          არმინდა გამომრჩეს ადამიანების ის კატეგორია,რომლებთან ერთადაც გავიზარდე,თუმცა
          ცხოვრება ხომ იცით როგორია, ყველა რა თქმა უნდა არ რჩება ჩვენს გვერდით.
          ზოგი სხვა სტილის ცხოვრებას მიჰყვება და რაც უფრო ვიზრდებით ვეღარ ვუგებთ
          ერთმანეთს. ხოშტო ჩემი ძმა შემოვრჩით ერთმანეთს და ძალიან მიყვარს ეს
          ბიჭი.ალალი მართალი და გულიანი ადამიანი,რომელიც ყოველთვის გვერდით
          დაგიდგება.მიხარია ხოშტოს წარმატება ყოველთვის. ძალიან კარგი შეყვარებული
          ჰყავს პირადად არვიცნობ, თუმცა ხოშტოს სიყვარულში დარწმუნებული ვარ.
          ყოველთვის გამიხარდება მათი ბედნიერება და მინდა ორივემ იცოდეს თუ ოდესმე
          წაიკითხავენ ამ ჩანახატს ჩემი იმედი შეუძლიათ ჰქონდეთ ყოველთვის. არ გვაქვს ისეთი ხშირი კონტაქტი,მაგრამ ვცდილობთ ერთად ვივარჯიშოთ და ვარჯიშის დროსაც დავეხმაროთ ერთმანეთს.
        </p>
      }
    </div>,
    <div key={4} className={styles.Friends_Per}>
      <h2>თავი 4</h2>
      {
        <p className={styles.Friends_description}>
          არმინდოდა კონკრეტული სახელი გვარები მეთქვა იმიტომ, რომ ბევრი ადამიანი
          შემოვიდა ჩემს ცხოვრებაში და გარკვეული მიზეზების გამო უკან წავიდნენ,
          თუმცა არსებობენ ადამიანები,რომლებმაც მოახერხეს და დღემდე გვაქვს ძალიან
          კარგი ურთიერთობა.არ შემიძლია არ ვახსენო ადამიანი, რომელიც უკარგესი,უთბილესი და
          უკეთილშობილესი,რომლის იმედიც ყოველთვის მაქვს. შეიძლება ვერ ვახერხებთ
          ხშირ კონტაქტს,თუმცა ყოველთვის ვიცი,რომ გვერდით მეყოლება და ანალოგიურად
          იცის თვითონაც.ეს ადამიანი ლიკა ბულაცაშვილი არის და გამოჩნდა ჩემს
          ცხოვრებაში ტურზე, სადაც დაქალთან ერთად იყო წამოსული და გავიცანი, მას
          შემდეგ ეტაპობრივად ვითარდება ჩვენი ურთიერთობა და ძალიან მახარებს ეს
          ფაქტი. როგორც ავღნიშნე არ მიჭირს ადამიანების ამოცნობა. ლიკას პირველად,
          რომ შევხვდი ვიგრძენი,რომ ძალიან საყვარელი და კარგი გოგო იყო და
          დღევანდელი გადმოსახედიდან თამამად შემიძლია ვთქვა,რომ არ ვცდებოდი, ჩემი
          შთაბეჭდილება გამართლდა და იმაზე კარგი აღმოჩნდა ვიდრე მე მეგონა.
          კეთილი, საყვარელი და შრომისმოყვარე ადამიანი, რომელიც ყოველთვის ჩემს
          მხარეს იყო, როცა გვერდში დგომა მჭირდებოდა. შეიძლება თვითონ ვერ
          ხვდებოდეს,რამდენად მნიშვნელოვანია ჩემთვის ეს ადამიანი, მაგრამ ბევრს
          ნიშნავს ლიკა ჩემთვის. იმის მიუხედავად,რომ მის დაქალთან საერთოდ
          ურთიერთობა კიარა კონტაქტიც აღარ მაქვს, მე ლიკასთან ცალკე ურთიერთობა
          ჩამოვაყალიბე,რასაც დღემდე ვაგრძელებთ და დარწმუნებული ვარ, რომ ძალიან
          დიდხანს გაგრძელდება ეს ყველაფერი.
        </p>
      }
      {
        <p className={styles.Friends_description}>
არ გამომრჩება ჩემი ბავშვობიდან დაწყებული ურთიერთობა,რომელიც ნინია შეყლაშვილთან მაკავშირებს. ყოველთვის ვიძახი,რომ ჩემი ბავშვობის ერთერთი საუკეთესო მოგონება არის ეს ადამიანი და მისი ოჯახი. იმის მიუხედავად,რომ ყოველდღიური ურთიერთობა არ გვაქვს ერთმანეთთან, ყოველთვის ბედნიერებით სავსვე ვარ,როცა მას ვხვდები. არ აქვს მნიშვნელობა სად ვართ და ვისთან ერთად ვცდილობთ,რომ ჩვენი ყველა შეხვედრა ტკბილად დაგვამახსოვრდეს. ქობულეთში გატარებული ბავშვობა ძალიან ძალიან ტკბილია მართლა. რაც გავიზარდე და მარტო დავდივარ ყველგან დასასვენებლად  რაღაცეები შეიცვალა. უფრო მორიდებული ვარ მომენტებში ვიდრე ვიყავი, საერთოდ ვეღარ ჩავდივარ ქობულეთში ნინიას უსაყვარლეს დედიკოსთან, არადა ბავშვობაში მამაჩემი რო იძახდა ვიქირაოთ ბინაო, ჩემი ხასიათი რადიკალურად იცვლებოდა, რადგან სულ ვიძახდი ქეთინოსთან იმდენად კარგად ვერთობი სხვაგან წამოსვლა არმინდათქო. თუმცა დროსთან ერთად ყველაფერი იცვლება. იმას კიარ ვიძახი,რომ არ მელოდებიან იქ და ვინმე არ დამიტოვებს პირიქით სულ მზად არიან, რომ მიმიღონ. რაც მე მაგის გამო ქეთინომ მეჩხუბა, რატო არ ჩამოდიხარ ჩვენთანო, თან როგაიგო რა სასაცილო ამბები გადაგვხდა თავს მე და ჩემ ძმაკაცებს, რომ მოვუყევი არ დავფიქრდი იმაზე,რომ მომკლავდა. ცოტახანს ქეთოზე ვისაუბრებ და დავუბრუნდები ნინიას აუცილებლად. ქეთო ყოველთვის უკეთილშობილესი ადამიანი იყო და გვერდშიმდგომი. ვიცოდი,რომ ნებისმიერ სიტუაციაში ჩემს გვერდით იქნებოდა. შეუძლებელია,რომ ქეთოსთან ერთად ცუდ ხასიათზე იყო. შეიძლება ძალიან დაღლილი იყოს და არ იყოს იმ მომენტში ხასიათზე,მაგრამ მაინც ყველანაირად შეეცდება,რომ შენ გამოგიკეთოს ხასიათი. ძალიან ბევრი მოგონება მახსენდება ქეთოზეც ბავშვობიდანვე, ზუსტად არმახსოვს ალბათ 2 წლის წინ ბათუმში გამოგვიჩნდა საქმე მე და ჩემ ძმაკაცს,მამაჩემი უნდა დაგვეტოვებინა ბათუმში, ქობულეთში გამოვიარეთ და ქეთოს დაიკო დაგვხვდა სახლში.რა თქმა უნდა ვერ მიცნო და არც გამკვირვებია,რადგან ძალიან დიდხანს არმყავდა ნანახი და შევიცვალე,ცოტა ვისაუბრეთ გამიხსენა,თან მამაჩემიც მოვიდა და ნათქვამი მაქვს,რომ ქეთო არაა სახლში და მიტყდება აქ დარჩენა წავალ ვიქირავებ სახლსთქო, ზუსტად 10 წუთში თბილისიდან ქეთო ურეკავს მამაჩემს და ეუბნება,რომ თბილისიდან მოვდივარ ხვალ დილით ქობულეთში ვიქნები, მანდ დამხვდეს მურო თორე მოვკლავო. მოკლედ ისე დამემუქრა,რომ ვიფიქრე აქედან მე და ჩემი ძმაკაცი წამსვლელები აღარ ვართქო. მოკლედ ასე,რომ გავაგრძელო არვიცი როდის მოვრჩები იმიტომ,რომ არ დავიღლები ქეთოზე დადებითი თვისებების ლაპარაკით.ისევ ნინიას დავუბრუნდები და ვიტყვი,რომ საკმაოდ მგავს ბევრ რამეში. ალბათ ერთერთი მნიშვნელოვანი ფაქტორი,რადგანაც ჩვენ ურთიერთობას ვაგრძელებთ და სულ გვიხარია ერთმანეთის ნახვა ეგ არის. ყოველთვის დიდი მნიშვნელობა აქვს როგორც წრეში ტრიალებ, ძალიან მიხარია,რომ ნინიას გარშემომყოფ ადამიანებს ვიცნობ, ნუ ყველას არა, მაგრამ ჩემთვის ძალიან სასიამოვნოა ეგ ფაქტი,როდესაც მეგობრის სანაცნობოს ვიცნობ,თან ძალიან კარგად ვუგებ და ვხვდები,რომ დიდი შანსია დროსთან ერთად ურთიერთობა საკმაოდ კარგად გავაგრძელო.ჯერ კიდევ ახალგაზრდები ვართ და წინ ძალიან დიდი დრო გვაქვს,რომ ისეთი მომავალი შევიქმნათ,როგორიც ჩვენ გვინდა. ეს ჩვენზეა დამოკიდებული და ვნახოთ,როგორ განვახორციელებთ.

        </p>
      }
      {
        <p className={styles.Friends_description}>
ვფიქრობდი,რომ დედაჩემზე და მამაჩემზე ჩემს შესახებ რაც მიწერია იქ დავწერდი, თუმცა ნამდვილად იმსახურებენ,რომ მეგობრებში ჩავწერო. ყოველთვის ვიძახდი,რომ ახალგაზრდა მშობელი რო ხარ ძალიან მაგარი გრძნობაა.  მე შეიძლება არ შემეძლოს ჩემ თავზე საუბარი ჩემ მშობლებთან,მაგრამ ვგრძნობ,რომ ყველა საკითხში ჩემს გვერდით არიან.დედაჩემი არის ადამიანი,რომელიც ერთი შეხედვით ძალიან სტრანი და სერიოზული ქალი ჩანს,როგორც მე ხასიათში დავემსგავსე ალბათ, თუმცა ამავდროულად ყველაზე მეტად შეუძლია სხვანაირად წარმოაჩინოს თავი ახლოდან,რომ გაიცნობ და დაუახლოვდები. ზოგადად ბიჭები დედებთან უფრო არიან გახსნილები,მაგრამ ჩემ შემთხვევაში ეგრე არაა. ზოგადად არავისთან მიყვარს საკუთარ თავზე საუბარი,მითუმეტეს ჩემს მშობლებთან. ემოციებს და სიყვარულსაც ვერასდროს გამოვხატავ მათ მიმართ, არადა უსაზღვრო სიყვარული მაკავშირებს ამ ადამიანებთან. მაკა არის ადამიანი,რომელიც ყოველთვის ყველაფერს აკეთებდა იმისათვის,რომ არაფერი მოგვკლებოდა მე და ჩემ ძმას. უზომოდ კეთილი ადამიანი და უზომოდ მოსიყვარულე. ეს არეტყობა შორიდან,როგორც მე მაგრამ დამიჯერეთ საკმაოდ კარგად შეუძლია სიყვარულის გამოხატვა. ყველა მშობელს და შვილს შორის არის უთანხმოება, ეგ ძალიან გასაკვირი არ უნდა იყოს. მე და მაკას პირველი უთანხმოება და გაბრაზება ჩემი მხრიდან იყო, როცა თითქმის  3 წლის ვიყავი და გავიგე,რომ ძმა მეყოლებოდა. ძაან გავუბრაზდი, ვეჩხუბე და დიდი ხანი აღარ ველაპარაკებოდი. გაბრაზება და ჩხუბი თურმე სულ მქონია ხასიათში. რაც უფრო დრო გადის და ასაკი მემატება უფრო მეტად ვიაზრებ,რომ რასაც მარიგებდა და მაჩვენებდა მიმართულებას სწორს და არასწორს შორის, ეგ ყველაფერი დამეხმარა,რომ სწორი მიმართულებით დავდივარ დღესდღეობით , ნუ ჩემი აზრით ასეა. ვერ გეტყვით,რომ იდენტური ხასიათი გვაქვს მე და დედაჩემს,მაგრამ გარკვეულ საკითხებში ვგავართ ერთმანეთს,აქედანვე ვაღიარებ,რომ მაკას ხასიათი სჯობს ჩემსას. მომენტებში იმდენად რთული ხასიათი მაქვს,რომ ხშირად უთქვამს დედაჩემს ვინ გაგიძლებს ეგრე მაგიტო არგყავს შეყვარებულიო. სუსტი წერტილი მიპოვნა და პირდაპირ დამარტყა. მაკასთან ბავშვობიდან ისე ვიყავი,რომ დედა შვილი არასდროს ვეგონეთ, ახლა მითუმეტეს გვერდიგვერდ,რომ ვდგავართ შეიძლება პირიქით ეგონოს ვინმეს. 
        </p>
      }
      {
        <p className={styles.Friends_description}>
იმის მიუხედავად,რომ ამ ადამიანთან სიყვარულს ვერ გამოვხატავ და ვერ ვაჩვენებ იმას,თუ რამდენად მიყვარს, შემიძლია,რომ რაც ჩანახატი მიწერია იმ მოცულობის ტექსტი მარტო ბერდიაზე დავწერო. ყველა შვილს საკუთარი მამა ყველაზე მეტად უყვარს და საუკეთესო მამა მისთვის ის არის,  მხოლოდ ამ კუთხით არ ვიძახი ამას, მამაჩემი მართლა სხვანაირი ადამიანი არის,  ცარიელი გული ყველა გარშემომყოფისთვის. ადამიანი არის,რომელსაც საკმაოდ ბევრი პრობლემა აქვს, თუმცა არასდროს არ აჩვენებს ადამიანებს ამ ყველაფერს. ეს მხოლოდ იმ მომენტში,თუ ნასვამია და მამა შვილური საუბარი გვიწევს. ეგ მომენტი მიყვარს იმიტომ,რომ მეც საკმაოდ ბევრის საუბარი შემიძლია მაგ დროს და ვცვლით აზრებს სხვადასხვა საკითხთან დაკავშირებით.უდიდესი პატივისცემა მაქვს ამ ადამიანის მიმართ და არასდროს ვყოფილვარ უმადური, პირიქით ყოველთვის ვაფასებ იმას,რაც ბერდიამ აქამდე გააკეთა ჩემს გამო და ყოველდღე აგრძელებს მაგის კეთებას. ჩვენს ერთმანეთთან ასეთ მაგარ ურთიერთობას და ძმაკაცურად ყოფნას ისიც ხსნის,რომ ძალიან დიდი ასაკობრივი სხვაობა არაა მე და ჩემს მშობლებს შორის. 44 წლის დედაა, 45 წლის მამა. ყოველთვის ისე ხდება,რომ მე და მამაჩემი ძმები ვგონივართ გვერდიგვერდ,რომ დავდივართ. ბოლო წლებია სიმაღლეშიც გავასწარი და მგონი მომენტებში მამაჩემზე დიდი შეხედულება მე მაქვს. არვიცი ალბათ ძალიან დაბალი შანსი არსებობს იმის,რომ მამაჩემი გაიცნო ახლოდან და ვერ გაუგო. აი უზომოდ კეთილი ადამიანი არის, შეიძლება საკუთარ ცხოვრებაში დიდი ჩავარდნა ქონდეს, მაგრამ იმდენს იზამს,რომ თავის მეგობრებს დაეხმარება მაინც. ვერ გეტყვით,რომ ძალიან ხშირად გვისაუბრია მე და მამაჩემს ძაან გახსნილად ერთმანეთთან,მაგრამ არის ეგეთი დღეებიც ჩემს წარსულში, სადაც საკმაოდ ემოციური საუბარი მქონდა მამაჩემთან, ნუ უფრო ზუსტად მამაჩემი საუბრობდა თავის პრობლემებზე და ამ მომენტში მე ვიყავი რჩევის და მოტივაციის მიმცემი ადამიანი. მთვრალი იყო და ყველა ემოცია ერთად მოაწვა ალბათ, ლაპარაკში წამოცდა,რომ დავიღალე ძაან სადაცაა თავს მოვიკლავო და ფიქრის გარეშე პირდაპირ ვუთხარი,რომ მაგას ვერ და არ იზამდა. შენი სიკვდილი პირდაპირ პროპორციულია ჩემ სიკვდილთან მეთქი, თავს იკლავ და სამ წამში მეც მოგყვებითქო. ეს რეალურად მართლა ეგრეა, უბრალოდ არცერთი ვართ მაგის გამკეთებელი. თვითონაც ძაან კარგად იცის,რომ გამოსავალი არ არის ეგ და ყველაზე ცუდი გადაწყვეტილება არის,რაც შეიძლება ადამიანმა მიიღოს. ვერ გეტყვით,რომ მამაჩემთან ერთად დალევაზე ვგიჟდები, ბოლომდე ვერასდროს მივყვები, მერე ვცდილობ,რომ სუფრიდან გავექცე და თავს ვუშველო,სანამ დრო მაქვს. ძალიან დიდი მოგონებები გვაქვს ერთად გადატანილი მთელ ოჯახს. რეალურად ერთად გავიზარდეთ მე და მამაჩემი ასე გამოდის,იმიტომ,რომ 20 წლის იყო მე რო დავიბადე. ალბათ 10 წლის ვიყავი უკვე მამაჩემი გვერდით მიჯდებოდა მანქანაზე და მატარებინებდა სოფელში, სულ იძახდა,რომ ბავშვობიდან უნდა მივაჩვიო მანქანის ტარებასო და კი გამოიღო ამ ყველაფერმა შედეგი. 17 წლის ვიყავი მართვის მოწმობა,რომ ავიღე,თან უნივერსიტეტში ჩავაბარე და მეორე დღეს მანქანა მიყიდა. ვერც კი წარმოვიდგენდი თუ პირველივე მანქანას ამხელა ძრავით მიყიდდა, მერე სულ მეჩხუბებოდა ნელა იარეო. ჩემს ვიდეობს  ნახულობდა შეკრებებზე,რომ ვსრიალებდი და მე მაჩვენებდა ვითომ ძაან გაბრაზებული იყო, არადა რეალურად ძმაკაცებთან ბლატაობდა, ნახე რამაგარ რაღაცეებს აკეთებს გიჟიაო. ერთერთი ემოციური მომენტი ჩემთვის იყო კიდე, ჩემი ძმა და რძალი,როცა წავიდნენ საქართველოდან მალევე გაიგო ბერდომ,რომ მეც ვაპირებდი საზღვარგარეთ წასვლას. მესაუბრა,რომ მეც მინდა შვილიშვილები გავზარდო, სხვის შვილებს ვეფერები ყოველთვის და სიყვარულს გამოვხატავო და თქვენს შვილებს რას ვუზამ ხო წარმოგიდგენიათო. მესმის ბერდოსი ძალიან კარგად,უბრალოდ ამ მომენტში კარგი და უზრუნველყოფილი მომავლისთვის ვიბრძვი და გადავდგამ ამ ნაბიჯს,რამდენად რთულიც არუნდა იყოს იმის მიუხედავად.

        </p>
      }
    </div>,
    <div key={5} className={styles.Friends_Per}>
    <h2>თავი 5</h2>
    {
      <p className={styles.Friends_description}>
        Შეიძლება ცხოვრებაში ნათესავი ვერ აირჩიო,მაგრამ მეგობრებს და ძმაკაცებს შენ არჩევ. Სწორედ ეს ხდება მიზეზი იმის,რომ ძალიან ბევრი გამოცდა გიწევს ცხოვრების მანძილზე. ეს გამომდინარეობს იქიდან,რომ ხშირია ადამიანების შემოდინება და გადინება შენს ცხოვრებაში. ამ ჩანახატიდანაც არის რამოდენიმე ადამიანი ამოშლილი, თუმცა მივხვდი,რომ ამოშლა არ არის სწორი.თუ ამ ჩანახატს კითხულობ და თვლი,რომ ყველა ზემოთ ჩამოთვლილ ადამიანთან მაქვს ისევ ურთიერთობა ცდები. უმეტესობასთან დღემდე ვმეგობრობ და ძალიან კარგად ვარ. არის რამდენიმე ადამიანი ამ ჩანახატში, რომელთანაც აღარ მაქვს ისეთივე ურთიერთობა,როგორიც მქონდა. Ბევრი მიზეზი შეიძლება იყოს, ალბათ გავიზარდეთ ყველანი და სხვადასხვა საკითხები უკეთესად გადავაფასეთ. ამ  ყველაფერმა საკუთარი გრაფიკი შეგვიცვალა და იმის გამო,რომ ხშირად კონტაქტი არგვქონდა ურთიერთობა დასრულდა. ავღნიშნე, ის ფაქტი,რომ ზოგი ადამიანი ამოშლილი არის, თუმცა მირჩევნია დავტოვო ჩანახატში  და რამდენიმე წლის შემდეგ ვნახო ვისთან მქონდა კონტაქტი.
      </p>
    }
    {
      <p className={styles.Friends_description}>
მთავარი არის ის ფაქტი,რომ ჩხუბით და აგრესიით არავისთან დამისრულებია ურთიერთობა. უბრალოდ ცხოვრების ჩვენებურად განვითარება მოვინდომეთ და სხვადასხვა გზებით წავედით ამ მიზნის შესრულებისკენ. ყოველი შემთხვევისთვის არცერთ ადამიანთან არვნანობ ურთიერთობას,რადგან კარგად ვისწავლე რას ნიშნავს ნამდვილი მეგობარი და ვის შემიძლია ვენდო. Ზუსტად ვიცი ვის უნდა დავუძახო ძმაკაცი და მეგობარი. შეიძლება ძალიან ბევრ ადამიანთან მაქვს კონტაქტი და კარგი ურთიერთობა, მაგრამ ეს ყველაფერი არ ნიშნავს იმას,რომ ამ ადამიანს მეგობარს ან ძმაკაცს ვეძახი.

      </p>
    }
    {
      <p className={styles.Friends_description}>
Ხშირად მქონია მომენტი,როდესაც ადამიანთან დავიწყე ჩვეულებრივი კარგი ურთიერთობა,თუმცა ძალიან მალევე თავი ჩემ ძმაკაცად ჩათვალა და ისე უხუმრია,რომ ყურადღება გამიმახვილებია მაგაზე და ადამიანურად მითქვამს,რომ არ არის ეს სწორი, რადგან არის გარკვეული სახის ხუმრობები,რომელსაც ძმაკაცსაც არ გავუტარებ. ამიტომ ის ფაქტი,რომ გარკვეული ზღვარი არსებობს,სანამ ძმაკაცი გახდება ადამიანი ჩვეულებრივი მომენტია. ძმაკაცები ყოველ სიტყვაში,რომ შეურაცხყოფას აყენებენ ერთმანეთს არც ეგ ზის ჩემს პიროვნებაში. შეიძლება უთხრა ხუმრობით და იცინოთ, მაგრამ ეს ყველაფერი რო სისტემატიურ სახეს იღებს, ძალიან მიუღებელი არის ჩემთვის. 
      </p>
    }
    {
      <p className={styles.Friends_description}>
ზოგადად 2023-2024  პერიოდში ბევრი სამსახური გამოვიცვალე,რაც პირდაპირ პროპორციულია იმისა,რომ ბევრი განსხვავებული ადამიანი გავიცანი. Შეიძლება ყველასთან ვერ ჩამოაყალიბო ისეთი ურთიერთობა,რომ სამსახურის გარეთ გააგრძელო. ამჟამად ვმუშაობ ჩემს ბიძაშვილთან ერთად შაკოსთან და მაგარი გულის ადამიანები გავიცანი. გიო, დათო, ვანო და ნიკა. Ძალიან დიდი მნიშვნელობა აქვს სამსახურში როგორ ადამიანებთან ერთად გიწევს ყოფნა. Ბევრს ვხუმრობთ სამსახურში და ძალიან ბევრ საინტერესო თემაზეც ვსაუბრობთ. სწორედ ასეთი დიალოგების მეშვეობით ვიგებთ ერთმანეთის დამოკიდებულებას სხვადასხვა საკითხთან დაკავშირებით. Მე და გიოს საერთო ინტერესები გვაქვს. Მოცეკვავეები ვიყავით ორივე, ისიც ფანდურზე უკრავს და ამ ყველაფერს,როცა იგებ ადამიანს გსიამოვნებს. ჯერ არ არის დიდი დრო გასული,რაც გავიცანი და ამიტომ ბევრს ვერ ვისაუბრებ ამ ადამიანზე, ასევე ბიჭებზეც. Პირველი შთაბეჭდილებით კარგი ადამიანები არიან და მიხარია მათი გაცნობა, დანარჩენს უკვე დრო გვიჩვენებს,ვისთან როგორი ურთიერთობა განვითარდება.

      </p>
    }
  </div>,
   <div key={6} className={styles.Friends_Per}>
   <h2>თავი 6</h2>
   {
     <p className={styles.Friends_description}>
       2017 წელს გავიცანი მარიამ არევაძე,რომელიც Მამაჩემის ძმაკაცის შვილი არის. Მამაჩემის ძმაკაცთან იდეალური ურთიერთობა მაქვს. Მათთან როავდივარ, როგორც საკუთარ სახლში ვგრძნობ თავს ისე ვარ.ზუსტად ერთი დღეც არიყო საჭირო იმისათვის,რომ ჩვენ ურთიერთობა დაგვეწყო. არ დამავიწყდება ბერდო და ირაკლი სვამდნენ და მე რა თქმა უნდა პირადი მძღოლი. ირაკლი მეჩხუბა შენ ჩემს შვილს როგორ არიცნობო, აქედან მივდივართ და უნდა გაგაცნო მარიამიო. 23 ივნისი იყო საკმაოდ ცხელი ამინდი. იმ პერიოდში სანზონაში ცხოვრობდნენ და მუხიანში აპირებდნენ გადმოსვლას. იმ საღამოსვე სახლში მოვედი და ეგრევე მივწერე მარიამს და ვსო იქ დაიწყო ჩვენი ძალიან მაგარი მეგობრობა. Მალევე გადმოვიდნენ მუხიანში და ხშირად ვნახულობდი. აბიტურიენტები  ვიყავით და ისტორიაზე ერთად დავდიოდით. Ძაან ბევრ მოგონებას ვქმნიდით. Სულ მიბრაზდებოდა იმაზე,რომ თვითონ მთელი დღე მეცადინეობდა, მე კიდე ავტობუსში წავიკითხავდი და უფრო კარგად ვაბარებდი. ყოველთვის ვიცოდი,რომ გვერდში მედგებოდა და ასეც მოხდა. Მალევე მარიამის დაქალები გავიცანი და ნელნელა ყველამ ერთად დავიწყეთ სკოლის შემდეგ  მუხიანში ერთმანეთის ნახვა. ია  და ნიკაც მარიამისგან გავიცანი და ძალიან კარგი ურთიერთობა ჩამოგვიყალიბდა ერთმანეთთან. Მესხიძეც მუხიანში ცხოვრობდა და გაცნობის შემდეგ ვნახულობდით. ყველა მოგონებას ვერ ჩამოვწერ რა თქმა უნდა, რადგან ძალიან ბევრი არის მართლა. Შემდეგ  გამოჩნდა მის ცხოვრებაში ადამიანი ვინც შეუყვარდა და დღემდე ძალიან მიხარია მათი ბედნიერება. გათხოვდა და როგორც ხდება ხოლმე ყოველდღიური კონტაქტი ვეღარ გვქონდა, თუმცა მაინც ძალიან მაგრად ვიყავით ერთმანეთთან..ეს ყველაფერი გამომდინარეობდა იქიდან,რომ ძალიან მაგარი ადამიანი აღმოჩნდა ბექა და ჩვენც ძალიან მაგარი ურთიერთობა ჩამოგვიყალიბდა.დავძმაკაცდით და ერთმანეთთან დიდ დროს ვატარებდით. Ბევრი ტკბილი მოგონება გვაკავშირებს და ბევრი ისეთი მოგონება,რომელიც არც ისე კარგია,თუმცა ახლა ტკბილად გავიხსენებთ. Ჩვენს ცხოვრებაში ყველას გვაქვს ჩავარდნა და ამ დროს სხვადასხვა გზას ვნახულობთ ამის დასაძლევად. ბექა ამერიკაში წავიდა და ისე მოხდა,რომ ძალიან დიდხანს არ გვქონდა კონტაქტი. ვაღიარებ,რომ ჩემი ბრალი არის ეს ყველაფერი,რადგან არ მომიკითხავს. უკვე ავღნიშნე,რომ ყველას ცხოვრებაში არის მომენტები,სადაც თავს ვერ ვგრძნობთ კარგად. Სწორედ ეს დრო მქონდა და მაქვს ახლა. Ჩემს შესახებ,რომ წაიკითხავთ თქვენით დააკავშირებთ პერიოდს ერთმანეთთან. Ძალიან დიდი ხანი არის უკვე მხოლოდ საკუთარი თავის განვითარებისკენ ვისწრაფვი და ეს  შეიძლება ცუდი არის იმ მხრივ,რომ ბევრი ადამიანი დავკარგე ამის გამო. არ მივცემ საკუთარ თავს და საკუთარ ცხოვრებას იმის უფლებას,რომ ეს ადამიანები საერთოდ გაქრნენ ჩემი ცხოვრებიდან.Ძალიან ხშირად ვნახულობდი იას და ნიკას. იმდენად დავახლოვდით ჩვენც,რომ სადმე წასვლას მოვიფიქრებდით თუარა ეგრევე ერთად ვჩნდებოდით. Შემდეგ მამაჩემმა ჯიპი იყიდა. Მე და ნიკამ ვიცოდით,რომ კარგი ზამთარი გველოდებოდა და ბევრი მოგონებები შეიქმნებოდა. ეგრეც მოხდა  მთელი ზამთარი ხან საბადურების ტყეში ვიყავით, ხან კოჯორში და მოკლედ სადაც თოვლს ვნახავდით ყველგან ჩვენ ვიყავით.

     </p>
   }
   {
     <p className={styles.Friends_description}>
2019 წელს  დაიბადა ჩემი სიყვარული კაცი სანდრიკა. Მარიამის პირველი ბიჭი,რომელიც 29 ოქტომბერს დაიბადა ჩემს დაბადებისდღეზე და ორმაგად ბედნიერი ვიყავი და ემოციებს ვერ ვიკავებდი. Მე მოვნათლე სანდრო და უზომოდ ბედნიერი ვარ,რომ ამ მაგარი ბიჭის ნათლია ვარ. არვიცი რამდენად კარგი ნათლია ვარ და მეც ძალიან მინდა უფრო მეტი დრო დავუთმო ჩემს ნათლულებს, თუმცა ყოველთვის ისე ვერ ხდება, როგორც ჩვენ გვინდა. ეს ყველაფერი არ მამართლებს მაგრამ მაინც მინდა,რომ ვაღიარო. დარწმუნებული ვარ,რომ დალაგდება ყველაფერი და სადნრიკასთვის უმაგრესი ნათლია ვიქნები.

     </p>
   }
   {
    <p className={styles.Friends_description}>
      ვერ გამოვტოვებ ჩემ ძმას საბას,რომელთანაც ვერ ვიტყვი,რომ იდეალური ურთიერთობა მქონდა ბავშვობიდან. ყოველთვის  ვჩხუბობდით, ჩვენ უბანში ისე იყო დაყოფილი ასაკობრივი კატეგორია,რომ ჩემი ასაკის არავინ იყო და მიწევდა ჩემი ძმის ასაკის ბავშვებთან ერთად თამაში. ერთად ვიზრდებოდით და უკვე,რომ გავიზარდეთ დაიწყო დაძაბულობა ერთმანეთში,რადგან ძალიან განსხვავებული ძმები ვართ, აი უზომოდ განსხვავებულები, არავის არსჯერა ხოლმე,რომ ძმები ვართ. იმ ყველაფრის ფონზე,რომ მე და საბა განსხვავებულები ვართ, არმომწონდა საბას ქცევები და ყოველთვის შენიშვნას ვაძლევდი, შეიძლება აგრესიულად გამომდიოდა მაგას ახლა ვიაზრებ უკვე გაზრდილი მურო. პატარები აღარ ვართ არცერთი დროსთან ერთად ყველაფერი იცვლება. 24 წლის მე ვარ და 21 წლის საბა.  უკვე დამასწრო ცოლის მოყვანა, არვიცი რატომ მაგრამ მთელი ბავშვობიდან ყველამ იცოდა,რომ საბა ჩემზე ადრე მოიყვანდა ცოლს. მარიამი ძალიან მიყვარს უკარგესი ადამიანი არის, კეთილი გოგო,რომელსაც სიყვარულის გამოხატვა შეუძლია ულიმიტოდ. მიხარია ამ ადამიანის გაცნობა და იმის გააზრება,რომ ჩემი რძალია. ჯერ კიდევ ვეჩვევი ამ სიტყვას. როდესაც მხედავს ისეთ მდგომარეობაში და სიტუაციაში,როცა არვარ ხასიათზე, ცდილობს,რომ გვერდში დამიდგეს და ხასიათზე მომიყვანოს ან მესაუბროს. მე და საბას არასდროს გვქონია იდეალური ურთიერთობა, თუმცა ცოლის მოყვანის შემდეგ შეიცვალა ეს დამოკიდებულება. აღარ ვჩხუბობ და შენიშვნასაც არაფერზე არ ვაძლევ.
    </p>
   }
 </div>,
  ];

  const divsPerPage = 2;
  const totalPages = Math.ceil(divs.length / divsPerPage);
  const startIndex = (currentPage - 1) * divsPerPage;
  const endIndex = startIndex + divsPerPage;

  const currentDivs = divs.slice(startIndex, endIndex);

  return (
    <div>
      {currentDivs.map((div, index) => (
        <div key={index} className="content">
          {div}
        </div>
      ))}
      <div className="pagination">
        {Array.from({ length: totalPages }, (_, index) => (
          <button
            key={index + 1}
            onClick={() => handlePageChange(index + 1)}
            className={currentPage === index + 1 ? "active" : ""}
          >
            {index + 1}
          </button>
        ))}
      </div>
    </div>
  );
};

export default Friends;
