import React, { useState } from "react";
import styles from "../friends/Friends.module.css";

const Friends = () => {
  const [currentPage, setCurrentPage] = useState(1);

  const handlePageChange = (page) => {
    setCurrentPage(page);
  };

  const divs = [
    <div key={1} className={styles.Friends_Per}>
      <h2>თავი 1</h2>
      {
        <p className={styles.Friends_description}>
          ჩემი აზრით დრო მოვიდა უნივერსიტეტის ბავშვებთან ერთად გატარებული ლამაზი
          დღეების მინიმალისტური ისტორიები მოვყვე, რომლებიც შეიძლება გარკვეული
          ადამიანების კატეგორიისთვის ჩვეულებრივი დღეები იყოს, რომლებსაც
          მეგობრებთან ერთად გაატარებს სადმე ბარში, თუმცა იმდროს სხვა დატვირთვა
          ქონდა ამ ყველაფერს, შეიძლება დღესდღეობით აღარ ვართ ერთად ეს ხალხი,
          თუმცა ძალიან ტკბილი და კარგი მოგონებები დაგვრჩა,რომლებსაც აუცილებლად
          გავიხსენებთ. გამოცდებამდე რამდენიმე საათით ადრე მისვლა და მეცადინეობა.
          დღემდე ძალიან მაგრად მახსენდება ის ფაქტი,რომ მათემატიკის გამოცდამდე
          ყველა ძაან ნერვიულობდა და 2 კვირით ადრე დაიწყეს სწავლა და მომზადება.
          მე და ერთმა ჩემმა ნაცნობმა მიშომ წინა დღეს გადავწყვიტეთ რო ცოტახანი
          ვაკის პარკში ჩავსულიყავით და ერთმანეთთან განგვეხილა რაც ვიცოდით. ისე
          მოხდა, რომ შუალედურზე ყველაზე დიდი ქულები მე და მიშომ ავიღეთ 35 დან 34
          ები. ეს ხო ჩვეულებრივი მომენტია, არაფერი განსაკუთრებული, თუმცა ძალიან
          კარგი ტკბილი მოგონებაა,რომელსაც გავიხსენებთ რამდენიმე წლის შემდეგ თუ
          შევხვდით ერთმანეთს. მე თავიდანაც ვახსენე,რომ მინიმალისტური დეტალები
          არის ის,რაც ჩემნაირ ადამიანებს ბედნიერებას ანიჭებს. ძალიან მიყვარს
          ზოგადად დეტალების დამახსოვრება.ახლა ვისაუბრებ ადამიანებზე,რომლებიც ამ
          პერიოდის განმავლობაში გავიცანი და დღემდე ძალიან კარგად ვართ,რისთვისაც
          თითოეულს ვაფასებ. არვთვლი იმ ხალხს,რომლებიც გაქრნენ ჩემი ცხოვრებიდან.
        </p>
      }
      {
        <p className={styles.Friends_description}>
          უნივერსიტეტის დასაწყისში გავიცანი ნიკა,რომელიც დღესდღეობით ჩემი
          ძმასავით არის. ძალიან საინტერესოდ განვითარდა ჩვენი ურთიერთობა,როდესაც
          ერთმანეთი გავიცანით არ ვიყავით ძალიან ახლოს ერთანეთთან,თუმცა ერთ
          დღესაც უნივერსიტეტში ყოფნის დროს დავიწყეთ საუბარი იმ თემაზე თუ სად
          ვაპირებდით ზაფხულში დასვენებას. იდეები გავცვალეთ და მოვიფიქრეთ,რომ
          ერთად წავსულიყავით ზღვაზე. ვფიქრობ,რომ ერთ-ერთი საუკეთესო
          გადაწყვეტილება იყო ზღვაზე წასვლა ჩემს მეგობრებთან ერთად,რადგან უფრო
          დავუახლოვდით ერთმანეთს და მას შემდეგ მოვდივართ ერთად ჭირშიც და
          ლხინშიც. ვერ ჩამოვთვლი ყველა მოგონებას, რადგან ძალიან ბევრი და
          საინტერესო მოგონება გვაქვს ერთად შექმნილი. ჩვენ ვართ ის
          ადამიანები,რომლებიც არასდროს იძახიან უარს გართობაზე, შეიძლება
          ითქვას,რომ ჩემთან შედარებით განსხვავებული ხასიათი აქვს და გარკვეულ
          საკითხებში სხვადასხვანაირად ვმსჯელობთ, თუმცა მაინც ყოველთვის ვუგებთ
          ერთმანეთს. ძალიან ხშირად გვქონია სიტუაცია,როცა სადმე გავსულვართ და
          უბრალოდ ჩვენს მომავალ გეგმებზე გვისაუბრია, რა შეიძლება გავაკეთოთ
          იმისათვის,რომ ისეთი მომავალი გვქონდეს. ზღვიდან ჩამოსვლიდან ალბათ 1
          წლის შემდეგ წავედით მე და ნიკა,, სოფელში ნიკას ოჯახთან. ერთი
          ჩვეულებრივი დღე იყო როცა დილის 5 საათზე გავიღვიძე და მამამის გავყევით
          საქმეებზე. შეიძლება დიდად ვერაფერში დავეხმარე, მაგრამ დღემდე ძალიან
          მიხარია და ძალიან კარგად მახსენდება ეს ყველაფერი. გამიხარდა ნიკას
          ოჯახის გაცნობა. მე და ნიკას ბებოს ნასაუბრები გვქონდა,რომ გოგოებს რო
          გავიცნობთ,პირველი ჩემთან მოიყვანთ ქასთინგზე შესამოწმებლადო. ალბათ უკვე
          წაიკითხეთ ჩემი და ერთი გოგოს ურთიერთობის მიმდინარეობა და დასრულება.
          ერთი ჩვეულებრივი დღე თენდება, დილით ვდგები ყავას ვსვამ და ვცდილობ
          შაბათ-კვირა დასვენებისთვის გამოვიყენო, მაგრამ ვინ გაცდის, ზარი
          შემოვიდა ნიკასგან და მითხრა სოფელში ავიდეთ ჩემთან ვიქეიფოთო. მოკლედ
          წავედით მანქანით მე ნიკა ჩვენი მეგობრები და ეს გოგო. დასრულდა ეს დღეც
          ძალიან კარგად და დიდი ხნის შემდეგ ვნახე ნიკას ბებო და რო ვსაუბრობდით
          და გაიგო,რომ ამ გოგოსთან დავასრულე ყველაფერი. “ისე რო მოიყვანე ეგრევე
          ვიფიქრე, რომ შენ უკეთესი შეგეფერებოდაო, მაგრამ არაფერი გითხარი რომ
          არგწყენოდაო”. ეს ყველაფერი როგორი მწარე რეალობაც არუნდა იყოს და როგორც
          არუნდა ჟღერდეს ასეა, ჩვენ ძალიან ბევრი ვიცინეთ და ისე გავაგრძელეთ
          ცხოვრება ვითომ არაფერი მომხდარა. ასევე ჩემი ოჯახის წევრებიც ნიკას
          ძალიან აფასებენ და უყვართ, სულ ყოველთვის აქვთ ნიკას იმედი და
          დარწმუნებული ვარ როგორც მე გამიხარდება ნიკას კარგი ამბის გაგება
          ანალოგიურად გაუხარდებათ. ჩვენმა ძმაკაცობამ ბევრი სხვადასხვა ადამიანი
          გამოიარა მაგრამ ერთმანეთი მაინც არ დავკარგეთ, რადგან სწორად და
          ადეკვატურად ვაანალიზებთ ყველა სიტუაციას. ნიკასთან ურთიერთობის პერიოდში
          ნიკას მხრიდანაც ბევრი ძალიან კარგი ადამიანი გავიცანი, ვისთანაც
          შემდგომში ურთიერთობა ჩამოვაყალიბე.მე და ნიკასთან ერთად ზღვაზე დეა და
          თაკო წამოვიდნენ,რომლებსაც საერთოდ არვიცნობდი. ძალიან შორიდან ვიცნობდი
          თაკოს და დეას პირველად შევხვდი წასვლის დღეს .გაცნობის დღიდან გულთან
          ახლოს მივიდნენ და საბოლოოდ ერთი სამეგობრო წრე შეიკრა, რომლებზეც სულ
          საუბრობენ.ვციტირებ `სთორებს ვნახულობ და ძალიან მიხარია,რომ ასეთი
          სამეგობრო ხართ, სულ ერთად დადიხართ`` ეს საუბარი მეც ყოველთვის
          მახარებდა, თუმცა დრო გადის და ჩვენც უფრო მეტი პასუხისმგებლობა
          გვემატება ცხოვრებაში. ხშირია მომენტი, როდესაც ყველა თავის გზაზე მიდის
          ცხოვრებაში, დროის ნაკლებობა იჩენს თავს და ის შეხვედრები,გართობა და
          მოგონებებიც იკლებს. ამ შემთხვევაშიც ვფიქრობ,რომ ასე მოხდა. დეას
          სამსახურის გამო თითქმის საერთოდ ვეღარ ვნახულობ და ვეღარც ხშირად
          ვეკონტაქტები. დეა ძაან მიყვარს როგორ ადამიანი, მაგრამ შეიძლება
          ითქვას,რომ ისეთივე ურთიერთობა აღარ გვაქვს, რაც გვქონდა დასაწყისში.
          რადგან სულ ყოველთვის ერთად ვერთობოდით და გავდიოდით ოთხივე, სადაც
          არუნდა წავსულიყავით. შემდეგ ისე გამოვიდა, რომ უფრო ხშირად თაკო
          გვნახულობდა,რამაც გამოიწვია ის,რომ დაგვიახლოვდა მე და ნიკას ძალიან.
          არქონდა მნიშვნელობა სად მივდიოდით, იცოდა,რომ ჩვენთან დაცულად იყო და
          ყველგან ჩვენთან ერთად მოდიოდა, მაგრამ გავიდა დრო გათხოვდა და ისე
          მოხდა,რომ ქვეყნიდან წავიდა. კონტაქტი ყოველთვის გვაქვს, მაგრამ ადამიანს
          დისტანციური ურთიერთობის დროს მაინც სხვანაირად გრძნობ თავს.
        </p>
      }
      {
        <p className={styles.Friends_description}>
          ყოველთვის ვიძახი, რომ არაქვს მნიშვნელობა ადამიანს რამდენი ხანია იცნობ,
          ურთიერთობა ყოველთვის გაჩვენებს რა ეტაპზე ხართ, ზუსტად ამის
          დამადასტურებელი ფაქტია, მე და გიოს ურთიერთობა. 2 წელი გახდება რაც
          ერთმანეთს ვიცნობთ,თუმცა მოვახერხეთ და ამ 2 წელში იმდენი ტკბილი
          მოგონება შევქმენით და იმდენად კარგად განვავითარეთ ურთიერთობა, რომ
          ბევრი ადამიანი რამოდენიმე წლის განმავლობაში ვერ ახერხებს. ამით იმას
          ვამბობ, რომ ზუსტად ვიცი ძმაკაცობის მნიშვნელობა და გვერდით ის
          ადამიანები მყავს, ვისაც რეალურად ძმაკაცს ან მეგობარს ვეძახი. ის
          მომენტიც არის, რომ ჩემზე დიდი არის ასაკით გიო,რაც იმას ნიშნავს,რომ
          ჩემზე მეტი გამოცდილება აქვს გარკვეულ საკითხებში. სწორედ ამიტომ
          ყოველთვის მიხარია გიოსთან საუბარი სხვადასხვა თემებზე, არ აქვს
          მნიშვნელობა პირად ურთიერთობაზე იქნება საუბარი თუ უბრალოდ მომავლის
          გეგმებზე. დარწმუნებული ვარ,რომ გიოსგან ისეთ რჩევას მივიღებ,რომელსაც
          აუცილებლად გამოვიყენებ.გიო,რომ გავიცანი იმ პერიოდში არ იყო ჩემთვის
          კარგი დრო, რადგან საკუთარი თავი დაკარგული მეგონა და სულ ვცდილობდი,რომ
          გართობით და დალევით ყურადღება გადამეტანა სხვა რამეზე. ვფიქრობდი,რომ ეს
          ყველაფერი დამეხმარებოდა, თუმცა დიდი ხნის შემდეგ დავფიქრდი და
          მივხვდი,რომ უბრალოდ საკუთარ თავს ვაძლევდი იმდენის უფლებას,რომ ეს
          ეფიქრა და რეალურად არაფრის გამოსწორებას არვცდილობდი. მაგრამ ამის
          მიუხედავად გიოსთან ურთიერთობა მაინც კარგად ავაწყე. ვერ ჩამოვთვლი
          რამდენი მოგონება გვაქვს ერთად, რადგან ერთნაირი ადამიანები ვართ,
          შეიძლება 2 წამში მოვიფიქროთ, რამე სიგიჟე და გავაკეთოთ. გაგვიკეთებია
          კიდეც და ამ ყველაფრის გამო ვერ ვთვლი. რა თქმა უნდა ამ ყველაფრით
          არაფერი სრულდება და კიდევ ძალიან ბევრ ლამაზ და საინტერესო ტკბილ
          მოგონებას შევქმნით ერთად.არშემიძლია არდავამატო თეო,რომელიც გიოს
          შეყვარებულია. ძალიან მაგარი ადამიანი არის,რომელიც ასაკით ჩემზე
          დიდია,თუმცა არასდროს მიგრძვნია თავი პატარად თეოსთან,ერთად ვერთობით
          ჩვენი დიდი სამეგობრო და ეგ მახარებს,რომ ყველა ერთი ჭკუის ვართ.ერთ-ერთი საუკეთესო მოგონება,რომელიც აუცილებლად მთელი ცხოვრება გაგვყვება ყველას არის გიოს და თეოს ხელის თხოვნა, ამ ყველაფრის დაგეგმვაში მთელ სამეგობროს მიგვიძღვის წვლილი, უემოციურესი დღე იყო. ზოგადად ყველამ იცის,რომ ემოციური ვარ და არ მივეკუთვნები იმ საზოგადოებას "ბიჭები არ ტირიან ძმა"-ს,რომ გაიძახიან.არ გამომრჩება ხურო, რომელიც წივილასგან და ნიკასგან გავიცანი. ამ ადამიანისგან პირველივე შეხვედრისას იმხელა სითბო და სიყვარული
          ვიგრძენი,რომ დარწმუნებული ვიყავი გავუგებდით ერთმანეთს და ასეც მოხდა.
          გარკვეული დროის შემდეგ ძმაკაცური ურთიერთობა ჩამოგვიყალიბდა და
          დღესდღეობით ძალიან ბევრ მოგონებას ვქმნით ერთად. ძალიან მაგარი გულის
          პატრონია ხურო და დარწმუნებით შემიძლია ვთქა,რომ მისი იმედი ნებისმიერ
          შემთხვევაში მექნება და თვითონაც ეგრე უნდა იყოს ჩემს მიმართ.რაც უფრო მეტი დრო გადის ზოგადად უფრო მეტს ვიგებთ ადამიანები ერთმანეთის შესახებ. ყველას გვაქვს გარკვეული სახის პრობლემები ცხოვრებაში. ხუროსაც ისეთივე ხასიათი აქვს,როგორც მე. რაც არუნდა ცუდი რამ ხდებოდეს ჩვენს თავს, არგამოვხატავთ ამ ყველაფერს და ვცდილობთ,რომ მეგობრებთან დროის გატარებით ყველაფერი დავაბალანსოთ.Ჩემთვის ერთერთი საუკეთესო შეგრძენა არის ის,რომ მამაჩემი გიჟდება ჩემს ძმაკაცებზე და ძაან უხარია,რომ ასეთ მაგარ ადამიანებთან ვძმაკაცობ. აქ მარტო ხუროზე არ არის საუბარი. ყველა ჩემს გარშემომყოფ ადამიანზე.გოგოებზე ბევრი არმისაუბრია, თუმცა დარწმუნებულები არიან,რომ მათთან ერთად დროის გატარება ძალაინ მიყვარს. თეო თიკუნა ნინო და მარი ჩვენი სამეგობროს განუყოფელი ნაწილი. Სადაც არუნდა ვიყოთ გვერდს გვიმშვენებენ და გვილამაზებენ დღეს.
        </p>
      }
      {
        <p className={styles.Friends_description}>
ზოგადად ძალიან მიხარია,რომ ჩემი ძმაკაცები ერთმანეთს იცნობენ და ძაან კარგი ურთიერთობა აქვთ ერთმანეთთან. ასევე იგივე ხდება,როცა ისინი მაცნობენ თავიანთ ძმაკაცებს. Სწორედ ეს მოხდა ჩვენ შემთხვევაშიც, ერთმანეთს გავაცანით ახლო სამეგობრო და ძალიან დავახლოვდით ყველა ერთმანეთთან. Წივილას ბავშვობის მეგობრები გავიცანი და საკმაოდ კარგი ურთიერთობა ჩამოგვიყალიბდა. დადუ და ტაბატა ორი უმაგრესი კაცი. არ არის დიდი დრო გასული რაც ეს ბიჭები გავიცანი,თუმცა ამ პერიოდში მოვახერხეთ, რომ უფრო განვითარებულიყო ჩვენი ურთიერთობა. Ძალიან მაგარი გულის პატრონები არიან ეს ადამიანები და მიხარია მათი გაცნობა. Სხვათაშორის უკვე მოვახერხეთ საკმაოდ კარგი მოგონებების შექმნა და აუცილებლად გავაგრძელებთ ამ ყველაფერს. დადუს მეორე ნახევარს არ გამოვტოვებ რა თქმა უნდა. Ძალიან კარგი შთაბეჭდილება დამიტოვა ამ ადამიანმა,ბევრი არმისაუბრია ანუკისთან,თუმცა საკმაოდ საინტერესო ადამიანი ჩანს. მიხარია,რომ ეს ორი ადამიანი ერთად არიან. ასაკით ჩემზე დიდები არიან დადუ და ტაბატა, რაც იმას ნიშნავს,რომ გარკვეულ საკითხებში ჩემზე მეტი გამოცდილება აქვთ და მიხარია მათთან საუბარი სხვადასხვა თემებზე. ვიცი,რომ მათი გამოცდილებიდან შეიძლება რაიმე რჩევა მომცენ. ჯერ არგვქონია ასეთი სახის დიალოგი, თუმცა დარწმუნებული ვარ ჩემს გვერდით იქნებიან ეგეთ მომენტში. ანალოგიურად ვარ განწყობილი მეც ნებისმიერ საკითხში ამ ადამიანების გვერდით ვიქნები, არ აქვს მნიშვნელობა ასაკით პატარა ვარ თუარა.

        </p>
      }
    </div>,
    <div key={2} className={styles.Friends_Per}>
      <h2>თავი 2</h2>
      {
        <p className={styles.Friends_description}>
          ასევე ძალიან საინტერესო არის ის ფაქტი,რომ მე და სერგო 4 წელი იწყება
          უკვე რაც ვიცნობთ ერთმანეთს,თუმცა ის ურთიერთობა არასდროს გვქონია,რაც
          2022 წელს ჩამოვაყალიბეთ, ეს ყველაფერი განპირობებული იყო იქიდან,რომ
          ერთნაირ სიტუაციებში ვიყავით და თითქმის ერთნაირი პრობლემები გვქონდა და
          თითქმის ყოველთვის ეგრე არის ხოლმე. ამავდროულად თემქაზე დიდი სამეგობრო
          გვყავდა,რომლებიც ნელნელა ცოტავდებოდა და საბოლოოდ მე და სერგო დავრჩით.
          რა თქმა უნდა მაქვს გარკვეული სახის ურთიერთობა მათთანაც, მაგრამ ასეთი
          ძმაკაცური ურთიერთობა, მხოლოდ სერგოსთან შევინარჩუნე. ძალიან ხშირად
          გვქონია მომენტი,როდესაც უბრალოდ საუბარი უნდოდა სერგოს და გავსულვართ
          გარეთ. ეს საუბარი გაგრძელებულა ღამის 3-4 საათამდე და ამ დროს ძალიან
          ბევრი თემა განხილულა ჩვენს თავებზე რა თქმა უნდა. რჩევები საკუთარი
          გამოცდილებიდან, თუ ის გამოცდილება არგვქონია რაზეც ვსაუბრობდით, მაშინ
          ამ სიტუაციაში ჩვენ, როგორ მოვიქცეოდით. ყოფილა მომენტი,როცა უბრალოდ
          არაფერი არგვინდოდა ყველაფრით დაღლილები ვყოფილვართ და მანქანაში მარტო
          მე და სერგოს დაგვილევია ლუდები და იმ დროსაც ძალიან ბევრი გვისაუბრია
          ჩვენს გარშემო დატრიალებულ ამბებზე, რადგან დღევანდელისგან განსხვავებით
          იმ დროს რთულად აღვიქვამდი ადამიანების წასვლას ჩემი ცხოვრებიდან, რაც
          საბოლოოდ მე მტკენდა გულს და ცუდად აისახებოდა ჩემს პიროვნებაზე. დიდი
          ხნის შემდეგ გადავწყვიტეთ,რომ ახალ სფეროში გამოგვეცადა თავი და
          დეველოპერობა დავიწყეთ. მე მანამდე მქონდა გამოცდილება ჩემით ვსწავლობიდ,
          თუმცა სერგომ მეც დავიწყებ კურსებს და ერთად ვიაროთო. ძალიან გამიხარდა
          ეს ყველაფერი, რადგან უფრო მოტივირებული ვიყავი და თან ის მომენტი
          მქონდა,რომ რაიმეს თუ ვერ გავიგებდით შემდეგ ერთმანეთს ავუხსნიდით და
          უფრო კარგად გავიაზრებდით ამ ყვეალფერს,თუმცა მოხდა ისე,რომ სერგომ თავის
          თავი უფრო დიზაინერობაში იპოვნა,ვიდრე დეველოპერობაში. მანდ გაიყო ჩვენი
          გზები, მაგრამ არცერთი დავნებდით და ისევ ისეთი შემართებით გავაგრძელეთ
          სწავლა, როგორი შემართებითაც დავიწყეთ ეს ყველაფერი. ბევრი მოგონება
          მაქვს სერგოსთან ერთად, ტკბილი მოგონებები,რომლებიც ძალიან კარგად
          გვახსენდება და ამავდროულად გვაქვს ისეთი მოგონებები,რომლებიც არც ისე
          კარგი იყო, თუმცა დღეს სიცილით ვიხსენებთ იმ ყველაფერს.ნინო,რომელიც
          გაცნობის სდღიდან დადებით შთაბეჭდილებას მიტოვებდა და უფრო ახლოდან
          გაცნობით მივხვდი, რომ ჩემი შთაბეჭდილება ამ გოგოზე ზუსტი იყო.
          ადამიანი,რომელიც სულ მზად არის,რომ მოგისმინოს.ასევე ძალიან დიდი
          მოგონებები მაკავშირებს,სეროგს მამიდაშვილებთან ხატიასთან და
          მარიამთან,ამ ორმა ადამიანმა იმდენი შეძლო,რომ 2022 წელს უამრავი
          მოგონება შექმნეს ჩემთან ერთად,ძალიან მიყვარს ორივე,არგამოვარჩევ
          არცერთს,თუმცა მგონია,რომ მარიამის და ჩემი ხასიათი ზუსტად ემთხვევა
          ერმანეთს და ეს უფრო გვაახლოვებს.
        </p>
      }
      {
        <p className={styles.Friends_description}>
          რაც შეეხება გეგოს და რუსოს. რუსოს მეხუთე წელია ვიცნობ და თავიდანვე
          ვიცოდი რო უსაყვარლესი გოგო იყო, თუმცა ვერ წარმოვიდგენდი,რომ შეიძლებოდა
          გეგო და რუსო ერთად ყოფილიყვნენ რამოდენიმე წელში. გეგოზე ბევრს ვერ
          ვისაუბრებ იმიტომ,რომ ძალიან ბევრის ლაპარაკი შემიძლია და ჩანახატი
          არეყოფა. გეგო არის ადამიანი, რომელმაც ჩემი აზრით ყველაზე მეტი იცის
          ჩემს შესახებ. არც გეგოსთან ვსაუბრობ ხოლმე ძალიან ბევრს, მაგრამ მაინც
          ყველაზე მეტი იცის, თვალებითაც კი შეუძლია მიხვდეს, რას ვაპირებ იმ
          მომენტში. დრო გავიდა და გავიზარდეთ სამივე. იმდენად ხშირი კონტაქტი აღარ
          მაქვს მათთან, თუმცა ეს არნიშნავს იმას,რომ ან რაიმე შეიცვალა ჩვენს
          ურთიერთობაში და ცუდად ვარ განწყობილი. პირიქით ვგიჟდები ორივეზე ისე
          მიყვარს, ძალიან ბევრი ტკბილი მოგონება გამაჩნია ამ
          ადამიანებთან,ცალკეულად გეგოს რაც შეეხება, მთელი ბავშვობა ერთად
          მოვდივართ და დღემდე ერთად ვართ. ამიტომ როგორც არუნდა ჟღერდეს. მთელი
          ჩემი ცხოვრება, რომელიც გეგოსთან ერთად გავატარე ძალიან ტკბილი
          მოგონებაა. საუკეთესო პერიოდი მაინც უკვე მოზრდილ ასაკში მქონდა, როდესაც
          გეგოსთან ერთად დავიწყე მუშაობა,რადგან ყოველდღე ერთმანეთს ვხვდებოდით,
          თუმცა ეს ყველაფერი სამსახურზე არ აისახებოდა. სამსახურში ვიყავით
          უბრალოდ თანამშრომლები და სამსახურის გარეთ ძმაკაცები და ბიძაშვილები. ამ
          პერიოდში რუსოსაც ხშირად ვნახულობდით ხოლმე, უბრალოდ მე, როგორც
          ყოველთვის მარტოხელა ძმაკაცი ვიყავი,რომელიც შეყვარებულ წყვილს რომანტიულ
          საღამოს უფუჭებს. მაგრამ ამ ყველაფრის მიუხედავად ყოველთვის უხაროდათ
          ჩემი გასვლა მათთან ერთად. ზამთრის პერიოდი იყო,როცა გეგო რუსო, რუსოს
          დიდი და მისი შეყვარებული აპირებდნენ ბაკურიანში წასვლას, უბრალოდ
          ხუმრობით ვუთხარი მეც წამიყვანეთთქო და ეგ დღე, რომ მოვიდა მართლა
          წავედი. ამ შემთხვევაში უარესად ეული გამოვჩნდი ორ წყვილს შორის მარტო
          ვიყავი. მაგრამ უმაგრესი იყო და ამაზე კარგი მოგონება ალბათ
          არშეგვიქმნია. ცოტას გეგოს შესახებ მოვყვები ეს არის ადამიანი, რომელთან
          ერთადაც გავიზარდე და ძალიან კარგად ვიცნობთ ერთმანეთს. ზუსტად ვიცით
          ერთმანეთის ხასიათი. ყოველთვის ვგრძნობდი გეგოს მშობლებისგან ანუ
          ბიძაჩემი და ბიცოლაჩემისგან, რომ ძალიან ვუყვარდი და ანალოგიურად ვარ
          დღემდე. ჩემი მხრიდანაც ძალიან დიდი სიყვარული არის ამ ადამიანების
          მიმართ.ზოგადად გამოხატვა არ შემიძლია,რაც არმომწონს, თუმცა ვცდილობ
          ხოლმე,რომ როგორც შემიძლია ისე გამოვხატო ეს სიყვარული, მხოლოდ სიტყვები
          არაფერს ნიშნავს, როგორც შემიძლია ხოლმე ქმედებით და სიტყვებით
          გამოვხატავ. იმის მიუხედავად,რომ ორივე ძალიან მიყვარს ბიცოლაჩემთან უფრო
          გახსნილი ვარ და უფრო არმიჭირს იმის გამოხატვა, თუ რამდენს ნიშნავს
          ჩემთვის და რამდენად ძვირფასია. ბიძაჩემზეც ანალოგიურად ვარ რა თქმა უნდა
          ძალიან მიყვარს და ვაფასებ, უბრალოდ ამ ყველაფერს ვერ გადავცემ ისე
          როგორც საჭიროა. მე და გეგოს გარდა ჩვენი მშობლების დამსახურებაა, რომ
          დღესდღეობით ასეთი ურთიერთობა გვაქვს და ვფიქრობ,რომ ეს ყველაფერი კიდევ
          ძალიან დიდხანს გაგრძელდება.
        </p>
      }
      {
        <p className={styles.Friends_description}>
          არანაირად არ გამომრჩება ადამიანი,რომელიც სრულიად შემთხვევით გამოჩნდა
          ჩემს ცხოვრებაში,თუმცა დღემდე ძალიან ახლოს არის ჩემთან და გულში მყავს
          ეს ადამიანი.ნინი გოგატიშვილი,რომელზეც შემიძლია ძალიან ბევრი
          გესაუბროთ.ადამიანია,რომელსაც 5 წელია ვიცნობ და თითქმის ყველაფერს
          ვუზიარებთ ერთმანეთს, ხშირ კონტაქტს ვერც ნინისთან ვახერხებ,მაგრამ
          ძალიან ვაფასებ,პირველ რიგში,როგორც ადამიანს და შემდეგ,როგორც
          მეგობარს.ეს ადამიანი გავიცანი აბიტურიენტობის დროს ჩემზე პატარა არის
          ასაკით, მაგრამ იმდენად კარგი მსმენელი და მრჩეველია, რომ ვერ იგრძნობ
          ასაკის სხვაობას, ძალიან მიყვარს ყველა მოგონება მასთან დაკავშირებული.
          თავიდან ძალიან შებოჭილები ვიყავით ურთიერთობაში თან პატარები ვიყავით,
          რაც უფრო გავიზარდეთ უფრო მეტ რამეს ვუყვებით ერთმანეთს და გვერდში
          ვუდგავართ, ეს ადამიანი არის ელენე ფირანიშვილი.ყოველთვის გვიხარია
          ერთმანეთის ნახვა,მიწერა, საუბარი და ასე შემდეგ.ხშირად არის
          მომენტი,როდესაც მამჩნევს ცუდ ხასიათს და წამიერად იცვლება ჩვენი
          მიმოწერა.იწყებს ჩხუბს იმ საკითხთან დაკავშირებით,რომ მგონი გარკვეული
          სახის პრობლემები გაქვს და არმიყვები და უნდა გნახო აუცილებლად.ძალიან
          ბევრი საინტერესო მოგონება გვაქვს ერთად ერთ-ერთი საუკეთესო მოგონება
          ალბათ ვინი ვიცის კონცერტზე წასვლა იყო, სადაც ანუკიც იყო.შეიძლება
          გაგიჩნდეთ კითხვა,თუ ვინ არის ანუკი ამას ცოტახანში გაიგებთ. საერთოდ
          შეგვეცვალა გემოვნება ყველას და აღარ ვუსმენთ ვინი ვიცს, მაგრამ კონცერტი
          დაგვეხმარა,რომ უფრო მეტად თავისუფლად ვყოფილიყავით ერთმანეთთან.რაც უფრო ვიზრდებით უფრო მეტი პასუხისმგებლობები გვემატება ცხოვრებაში და დროსაც ძალიან ბევრს ვხარჯავთ,სწორედ ამიტომ იმ სიხშირით ვეღარ ვნახულობთ ერთმანეთს,თუმცა ერთმანეთის ამბებს მაინც ვიგებთ და რა თქმა უნდა ძალიან გვახარებს ერთმანეთის კარგი ამბავი. ყოველთვის მზად ვარ,რომ გვერდში დავუდგე და დავეხმარო ნებისმიერ საკითხში. უკვე
          ვახსენე ანუკი,რომლის გაცნობაზეც დღემდე მეცინება. ერთი ჩვეულებრივი დღე
          არის და ინსტაგრამზე მაფოლოვებს ძალიან ლამაზი ქერა გოგო, ვაა მეთქი მურო
          მორცხვობა გვერდით გადადე და მიწერე. რა თქმა უნდა გადავდგი ეს ნაბიჯი
          დავიწყებ საუბარი, თუმცა ჩვენი ქალაქი ხო ძალიან პატარაა, ყველგან
          ნაცნობს ვპოულობთ. ელენე მიგდებს ანუკის ფოტოს ინსტაგრამზე,მეთქი რახდება
          მამაო ანუკის აქ რაუნდა. ეს რა თქმა უნდა ხუმრობით, ძალიან გამიხარდა ის
          ფაქტი,რომ ერთმანეთს იცნობდნენ და დაქალობდნენ,რადგან ეგ ყველაფერი გახდა
          იმის მიზეზი,რომ ანუკისთანაც ძალიან კარგი ურთიერთობა ჩამომიყალიბდა. არ
          აქვს მნნიშვნელობა რამდენად ხშირად ვნახულობთ ერთმანეთს, საკმაოდ ბევრი
          და საინტერესო მოგონება შევქმენით ერთად.პირველ რიგში ამის მიზეზი გახდა
          ის ფაქტი,რომ ერთნაირი ინტერესები გვაქვს ძალიან ძალიან ბევრი. შეიძლება
          ყოველდღე არვნახულობთ ერთმანეთს და არც ყოველდღიური კონტაქტი გვაქვს
          ერთმანეთთან, თუმცა ეს არასდროს გამხდარა იმის მიზეზი,რომ ურთიერთობა
          გაგვეწყვიტა ან რაიმე მსგავსი.
        </p>
      }
      {
        <p className={styles.Friends_description}>
          ანუკიმ შემომთავაზა ბანაკში წასვლა და რა თქმა უნდა დავთანხმდი, რადგან
          ზოგადად ყოველთვის ვცდილობ ახალი გამოწვევები მივიღო და საკუთარი თავის
          განვითარებისკენ კიდევ ერთი ნაბიჯი გადავდგა. ჯერ მეორე დღეა რაც აქვარ
          და უკვე მაქვს გარკვეული შთაბეჭდილება ყველასთან დაკავშირებით. არვიცი
          როგორ გაგრძელდება ყველაფერი, თუმცა მე ჩემს მაქსიმუმს ვეცდები,რომ
          ბავშვებს კარგად დავამახსოვრდე, რადგან ჩემთვის უსაყვარლესი ადამიანები
          გახდნენ. ამ გადაწყვეტილებას არასდროს არ ვინანებ,რადგან როგორც
          კარიერულად მივიღებ სხვა სფეროში გამოცდილებას,ასევე ბავშვებთან მექნება
          ასეთი სახის ურთიერთობა,როდესაც მასწავლებლის როლს ვირგებ. მესამე დღე
          არის,რაც ბანაკში ვარ ამ კარგ ადამიანებთან ერთად, ნელნელა უფრო
          ვუახლოვდები აქ მყოფ მასწავლებლებს, ხელმძღვანელს და მოკლედ სტაფის
          წევრებს. ეს ყველაფერი ძალიან მახარებს,რადგან უკვე ბევრი საინტერესო რამ
          გადაგვხდა თავს. საინტერესო ფაქტებთან და ამ სიხარულთან ერთად,
          ვგრძნობ,რომ ძალიან დიდი პასუხისმგებლობა მაქვს აღებული ამ ბავშვების
          მიმართ. ყოველთვის ვცდილობ,რომ ნაცნობობა არ გამოვიყენო და საკუთარი
          თავის მაქსიმუმი გავაკეთო და დავამტკიცო,რომ ვიმსახურებ ამა თუ იმ
          პოზიციაზე ყოფნას. ძალიან დიდ პატივს ვცემ ხელმძღვანელს და მინდა,რომ
          მისი იმედები გავამართლო. დღევანდელი გადმოსახედიდან,რომ ვიმსჯელო
          შეიძლება ვერ გამომივიდა საკუთარი თავის საუკეთესო ვერსიად ყოფნა,
          ზოგადად არასდროს ვიღებ შენიშვნას ცუდად,რადგან ვხვდები,რომ რაიმე
          შეცდომა დავუშვი. რა თქმა უნდა შეცდომები ყველას მოგვდის და სწორედ
          ამიტომ ძალიან სწორად აღვიქვი მარიამსი ნათქვამი. სწორიც არის რეალურად
          ყოველთვის ვცდილობდი,რომ ძაან მკაცრი არ გამოვჩენილიყავი
          ბავშვებთან,მაგრამ დღეს მივხვდი,რომ ძალიან ცუდად გამოიყენებდნენ ამ
          ყველაფერს ამიტომ წინა დღეებთან შედარებით თითქმის ყველას გავაკეთებინე
          აზიდვები ბუქნები და მოკლედ ჩვეულებრივი დასჯა. იმედი მაქვს ცოტა ცუდი
          ნათქვამია, დარწმუნებული ვარ,რომ ხვალიდან ყველაფერს შევეცდები,რომ ყველა
          აქ მყოფი სტაფს ვაჩვენო ჩემი შესაძლებლობები.
        </p>
      }
      {
        <p className={styles.Friends_description}>
          რაც შეეხება ბავშვებს აი არვიცი საიდან დავიწყო ზოგადად ძალიან მიყვარს
          ბავშვებთან კონტაქტი, მაგრამ არასდროს არმქონია ასეთი სახის ურთიერთობა
          მათთან და ვფიქრობ,რომ ერთ-ერთი ყველაზე კარგი გამოცდილება ჩემს
          ცხოვრებაში. უსაყვარლესი და უჭკვიანესი ახალგაზრდები არიან,რომლებსაც
          ძალიან ძალიან დიდი მომავალი აქვთ დარწმუნებული ვარ, მთავარია საკუთარ
          თავში იპოვნონ მოტივაცია,რომელიც შემდგომ დისციპლინაში გადაუვათ და
          შეეცდებიან რომ საკუთარ თავზე ბევრი იმუშაონ და განავითარონ საკუთარი
          თავები. შობის დღესასწაულიც რა თქმა უნდა ბანაკში გავატარეთ ყველამ
          ერთად.ძალიან დამღლელი,მაგრამ ამავდროულად ბევრი კარგი მოგონების შექმნის
          დღე იყო. ცხოვრებაში პირველად ვცადე ციგურებზე დადგომა და სიმართლე,რომ
          ვთქვა ამ კონკრეტულ პერიოდში, არც თუ ისე სასიამოვნოდ მეჩვენება ეს
          ფაქტი,რადგან საკმაოდ რთული აღმოჩნდა სწავლის პროცესი. ვერ ვთვლი
          რამდენჯერ წავიქეცი მოედანზე,მაგრამ ეს ყველაფერიც ძალიან მაბედნიერებს,
          იმის მიუხედავად,რომ ძაან დამცინეს მათ სახეზე ღიმილმა გამახარა.ყველანი
          უსაყვარლესად ცდილობდნენ ჩემთვის ესწავლათ ციგურებით სრიალი.საღამოს მე
          და ერთერთ თანამშრომელს დაგვევალა კოცონის მომზადება საღამოსთვის.
          საკმაოდ საინტერესო საღამო გამოვიდა,სადაც ნებისმიერ ადამიანს შეეძლო
          განტვირთვა. ამ ყველაფრით შობის დღე არ დაგვისრულებია, სასტუმროში
          შემოსვლის დროს დაიწყეს სიმღერა,რასაც მეორე სიმღერა მოჰყვა და ასე
          ექსტრა ფართი გამოგვივიდა. ამის შემდეთ სტაფის წევრებმა გავცვალეთ სეკრეტ
          სანტას საჩუქრები. აზრი იდო იმაში,რომ ჩვენით უნდა შეგვექმნა ყველაფერი.
          ამომივიდა ჰანა,ვისთანაც არმქონია აქამდე კონტაქტი,მაგრამ ბავშვების
          დახმარებით გავარკვიე მისი საყვარელი ფერი და სხვადასხვა ჰობი, ერთერთი
          მათგანი არის ბოულინგი და გადავწყვიტე მაგიდის თამაში, არაფერი
          განსაკუთრებული,მაგრამ მთელი გულით შევეცადე კარგი გამოსულიყო. მე
          მაჩუქეს პლასტელინით გამოძერწილი ფანდური,რამაც ძალიან გამახარა.
          შეიძლება იფიქროთ,თუ რატომ გამიხარდა პლასტენილით გაკეთებული ნივთი,
          თუმცა როგორც ჩემი ჩანახატებიდან უკვე იცით ვარ ადამიანი ,რომელსაც
          შეუძლიაა ძალიან ბევრი რამ დაიმახსოვროს და ასეთი მცირე საჩუქრებით
          მიიღოს ბედნიერება. ამ შემთხვევაში სეკრეტ სანტას გამო ვსაუბრობ
          საჩუქარზე,თორე საერთოდ არ აქვს ჩემთვის მნიშვნელობა.
        </p>
      }
    </div>,
    <div key={3} className={styles.Friends_Per}>
      <h2>თავი 3</h2>
      {
        <p className={styles.Friends_description}>
          არიან კიდე ჩემს ცხოვრებაში მნიშვნელოვანი ხალხი,უბრალოდ ასე ისტორიებით
          ვერ მოვყვები ყველას შესახებ. სხვათაშორის დასაწყისში ტურებზე მქონდა
          საუბარი. თუმცა არვახსენე ადამიანები, რომლებმაც მიმიღეს და შეიძლება
          ითქვას, რომ ერთერთი ოჯახის წევრი გავხდი. კონკრეტულ სახელებს არვიტყვი,
          თუვინმე წაიკითხავს ამ ჩანახატს მიხვდებიან ვისაც ეხებათ. არმინდა,რომ
          ვინმე გამომრჩეს და ამიტომ არავის ეწყინება იმედია,უბრალოდ ყველასთან
          არმაქვს ბევრი მოგონება, თუმცა მცირე მოგონებაც საკმარისი გახდა,რომ ამ
          ადმიანებთან გარკვეული სახის ურთიერთობა ჩამომეყალიბებინა,რომელიც
          დროსთან ერთად განვითარდება.თუმცა მაინც უნდა ვთქვა სახელები.პაპაშა
          ადამიანი,რომელთანაც უკარგესი ურთიერთობა ჩამოვაყალიბე და ძალიან კარგად
          გრძელდება,ამ ადამიანის გული,რომ დავინახე და ანალოგიურად მან ჩემი
          დაინახა მაგიტომ ავაწყეთ ასეთი კარგი ურთიერთობა,თავისუფლად შემიძლია
          ძმაკაცი დავუძახო ამ ადამიანს,რადგან ვგრძნობ იმ ურთიერთობას,რაც
          ძმაკაცობისთვის საჭიროა.ზოგადად არვეძახი ბევრ ადამიანს ძმაკაცს,
          სხვათაშორის ბოლო მომენტში უფრო გახსნილად და ბევრს ვსაუბრობთ და მიხარია
          ძალიან.ბოლო საუბარი ძალიან სიღრმისეული და საინტერესო იყო, რასაც
          ვფიქრობდი და საკუთარ თავთან მქონდა მხოლოდ საუბრები პაპაშასთან
          ლაპარაკმა ეგ ფიქრები უფრო გამიღრმავა და მოვახერხეთ ერთად,რომ
          ოვერსინქინგი დასრულებულიყო.ძალიან ახლოს ვარ ამ ადამიანთან და ყველაზე
          მეტად ის მახარებს,რომ ისტორიის შელამაზება არმიწევს და სხვანაირად
          მოყოლა.რაც ხდება ზუსტად ისე ვყვებით,ხოლმე ერთმანეთში. მიხარია ამ
          ადამიანის გაცნობა. შეიძლება ითქვას,რომ ორივესთვის საკმაოდ რთულ
          პერიოდში გამოვჩნდით ერთმანეთის ცხოვრებაში. დიდი ალბათობით ჩვენი
          დაახლოების ერთ-ერთი მთავარი მიზეზი ეგ არის,რომ არა მარტო რთული
          პერიოდები არამედ ძალიან ბევრი საერთო გვაქვს. ინტერესები, აზროვნება,
          საუბარი და კიდევ ბევრი. ხასიათებს ვერ ვიტყვი,რადგან ვფიქრობ ჩემზე
          ბევრად კარგი ხასიათი აქვს. იმის მიუხედავად,რომ თუ აფეთქდა მაშინ ძაან
          გიჟია, მაინც კარგად შეუძლია საკუთარი ემოციების და თავის კონტროლი.
          ჩემგან განსხვავებით, მე ადვილად ვღიზიანდები და მარტივად ვბრაზდები,
          თუმცა მეც ვცდილობ, რომ თავი შევიკავო და არ ავფეთქდე,რადგან ამ მომენტში
          ძალიან აფექტურად ვარ და შეიძლება ძალიან ცუდი,რამ გავაკეთო. მე და
          პაპაშას შორის ის მომენტი არყოფილა, რომ ერთმანეთისთქვის გვეთქვა
          ვიძმაკაცოთ ან რამე მსგავსი. ნელნელა დინებას მივყვებით და ზუსტად იქ
          ავღმოვჩნდით, სადაც ახლა ჩვენი ურთიერთობაა. ზაფხულში ოჯახთან ერთად იყო
          წასული ლაგოდეხში, მე არვიცნობდი ოჯახს და გამიტყდა ჩასვლა, თუმცა
          სექტემბერში მხოლოდ ჩვენ ახალგაზრდები წავედით გიოს სოფელში. წასვლამდე
          გავიცანი ოჯახი და აი უბედნიერესი ვარ დღემდე,რადგან ძალიან მიყვარს
          პაპაშას ოჯახი და მეც შევუყვარდი ამ ადამიანებს. ლაგოდეხში იმის
          მიუხედავად,რომ 3 დღე ვიყავით ძალიან გავერთეთ და ძალიან დიდხანს
          გაგვყვება ეს მოგონება დარწმუნებული ვარ. მას შემდეგ მამამის
          ვესაუბრე,რომ თქვენთან ერთადაც აუცილებლად წამოვალ სოფელში, რადგან
          დარწმუნებული ვარ,რომ კარგად გავერთობით ყველა ერთადთქო.მართლა ძალიან
          გამიხარდა მისი ოჯახის გაცნობა, ნინიკო არის პაპაშას პატარა
          დაიკო,რომელზეც ვგიჟდები ისე მიყვარს. დარწმუნებული უნდა იყოს,რომ
          ნებისმიერ შემთხვევაში შეუძლია ჩემი იმედი ქონდეს.დედიკოზე საუბარი
          არმაქვს,ზოგადად უფრო მარტივად გამოვხატავ ემოციებს და სიყვარულს სოფოს
          მიმართ. მცირე მოგონებებით იმდენად დავახლოვდით მე და პაპაშა, რომ
          ადამიანს ოჯახში, რომ შემოუშვებ ის უკვე შენი ძმასავითაა. ჩემთან ხშირად
          დარჩენილა და ჩემებს ძაან უყვართ, ზოგადად უხარიათ, რომ ასეთი კარგი
          საძმაკაცო სამეგობრო მყავს. მამაჩემი სულ მეუბნება მოიყვანე სახლში და
          გამაცანი ყველაო. შეიძლება მე და გიომ ერთი და იგივე თემაზე ვისაუბროთ
          ყველა შეხვედრაზე, მაგრამ ყოველთვის სხვადასხვა რამეს ვსაუბრობთ, იმდენად
          კარგად შეგვიძლია ერთმანეთთან საუბარი. არის სიტუაციები თან ძალიან
          ხშირი, როდესაც ისე ვიცინით ღამე სახლიდან გაგდებით გვემუქრებიან ორივეს.
          ძალიან თავისუფლად შეგვიძლია ყველაფერი ხუმრობაში გავატაროთ და
          ამავდროულად თუ საჭირო გახდა და მოთმენის უნარი იმ მომენტში დავკარგე
          იგივე ხუმრობის გამო ძალიან მწარედ ვაწყენინოთ ვინმეს. პაპაშას მხრიდან
          ძალიან კარგი ადამიანები გავიცანი და მეც გავაცანი ჩემი საძმაკაცო
          სამეგობრო და ძაან მიხარია ყველას ძალიან კარგი ურთიერთობა,რომ გვაქვს
          ერთმანეთთან. იცის გიომ,რომ ნებისმიერ დროს მზად ვარ გვერდში დავუდგე.
          ძალიან ბევრი ადამიანები ჩამოვიშორეთ და პირიქით მიხარია,რომ
          წასასვლელები წავიდნენ. ყოფილა ხშირად მომენტი,როცა სურდათ მე და გიოს
          შორის დაძაბულობა ყოფილიყო და ამის გამო ბევრი ტყუილიც მომისმენია.
          არვიცი ეს რის გამო შეიძლება ყოფილიყო. ჰგონებიათ, რომ მე და გიო
          ბავშვობის ძმაკაცები ვიყავით. 1წელი და 4 თვეა რაც ვიცნობ,მაგრამ ამ
          დროის მანძილზე მე და გიომ შევძელით,რომ ძალიან ახლოს ვყოფილიყავით
          ერთმანეთთან. წინ დიდი გზა გვაქვს, რასაც აუცილებლად ერთად გავივლით.
          დარწმუნებული ვარ, რომ ბევრი წინაღობა შეგვხვდება და 100%-ით მზად
          ვარ,რომ დავხვდე ამ გამოწვევას დავამარცხო და საბოლოოდ საკუთარი თავის
          საუკეთესო ვერსია გავხდე.
        </p>
      }
      {
        <p className={styles.Friends_description}>
          სხვათაშორის ბოლო დროს ძალიან შემცირდა იმ ადამიანების კატეგორია, ვისაც
          ვენდობი და ძმაკაცად ან მეგობრად აღვიქვამ, თუმცა პაპაშას მხრიდან
          გაცნობილმა ადამიანმა იმდენად კარგი შთაბეჭდილება დამიტოვა,რომ ძალიან
          დიდი სურვილი მქონდა უფრო ახლოდან გაგვეცნო ერთმანეთი. არ მგონია, რომ
          კარგ სიტუაციაში გამიცნო, მაგრამ დარწმუნებული ვარ ცუდი შთაბეჭდილება არ
          ექნებოდა ჩემზე. საუბარი მაქვს დიანა მახარაძეზე. აი მართლა ადამიანი
          არის,რომელიც ძალიან მცირე დროის წინ გავიცანი, თუმცა ვენდობი და სურვილი
          მაქვს, რომ უფრო დავახლოვდეთ. იცის,რომ ნებისმიერ მომენტში შეუძლია
          მენდოს და ნებისმიერ საკითხზე შემიძლია ვესაუბრო. არ გვაქვს მე და დიანას
          ბევრი მოგონება ერთად, თუმცა ჯერ ახალგაზრდები ვართ და წინ ძალიან დიდი
          გზაა, რასაც ერთად გავივლით და ძალიან ბევრ საინტერესო მოგონებას
          შევიქმნით. პირობა გვაქვს დადებული, რომ 2024-ის ბოლოს საერთოდ სხვა
          ფორმაში უნდა ვნახოთ ერთმანეთი და დარწმუნებული ვარ,რომ ყველა
          შევასრულებთ ამ პირობას. არ შემიძლია ბევრი საუბარი მოგონებებზე, თუმცა
          დიდი სურვილი მაქვს ჩემი შთაბეჭდილება გაგიზიაროთ ამ ადამიანთან
          დაკავშირებით. ძალიან ახლოდან არვიცნობ ჯერჯერობით, მაგრამ დიალოგი
          გვქონდა გარკვეულ საკითხთან დაკავშირებით და ძალიან მარტივად შემიძლია
          მივხვდე ადამიანი როგორი არის. მოკლედ რომ გითხრათ ეს ადამიანი მგონია,
          უკეთილშობილესი გოგო,რომელიც ყოველთვის მზად არის მოგისმინოს,დაგეხმაროს
          და გვერდში დაგიდგეს. მგონია ცოტა ცუდი ნათქვამია. დარწმუნებული ვარ,რომ
          ასეთი ადამიანი არის. ზუსტად ვიცი,რომ შრომისმოყვარე ადამიანი არის და
          დასახული მიზნის მიღწევისკენ ყოველთვის მიიწევს. საერთო შეიძლება მე და
          დიანამაც ბევრი გამოვნახოთ, მინიმუმ იმ ფაქტით,რომ წარსულის მეგობრები
          გაიფანტნენ ჩვენი ცხოვრებიდან. აუცილებლად მეტს გესაუბრებით დიანას
          შესახებ,როდესაც უკეთესად გავიცნობ. ამავდროულად გავიცანი ანა კარტოზია
          პაპაშას მხრიდან,რომელთანაც ძალიან კარგი ურთიერთობა ჩამომიყალიბდა.
          მიხარია,რომ ვიცნობ და ბევრი კარგი და ლამაზი მოგონება გვაქვს ერთად.
          უსაყვარლესი ადამიანი არის.ცოტა ემოციური, მაგრამ ეგ საჭიროა პირიქით.
          ყველას ცხოვრებაში არის რთული პერიოდი და ამას აუცილებლად მეგობრებთან
          ერთად გადავლახავთ. ანა ჩემთვის არის ერთ-ერთი ახლო მეგობარი,რომელთანაც
          ძალიან თავისუფლად ვგრძობ თავს და შებოჭილი არვარ. არმიწევს ისე მოვიქცე,
          როგორიც რეალურად არვარ. ვერასდროს ვერ მოვაჩვენებ თავს სხვა ადამიანად,
          რადგან არ არის ეგ ჩემი ძლიერი მხარე. ანა გავიცანი ტურებზე, სადაც
          ძალიან ბევრი კარგი და საინტერესო მოგონება დავიგროვეთ მე ანამ და
          პაპაშამ. ჩვენი სამეგობრო წრეც უფრო დიდი იყო, თუმცა დრო გადის და
          გარკვეულ საკითხებს სხვანაირად აღვიქვამთ, ვიცი, რომ კეთილი ადამიანი
          არის,რომელიც ყოველთვის ჩემს გვერდით იქნება და შეეცდება,რომ დამეხმაროს.
          ანალოგიურად დარწმუნებული ვარ,რომ ჩემი იმედი ყოველთვის ექნება ნებისმიერ
          საკითხში,რადგან ყოველთვის მზად ვარ ანას გვერდით ვიდგე და დავეხმარო.
          შემიძლია მთელი ღამით ვესაუბრო და საკუთარი გამოცდილებიდან პატარა
          რჩევები მივცე. შეიძლება ამ ადამიანზე 2 წლით დიდივარ მაგრამ ასაკობრივი
          განსხვავება არასდროს იგრძნობა. უბრალოდ იმას ვიძახი,რომ შეიძლება
          გარკვეულ საკითხებში მეტი გამოცდილება მქონდეს, რაც მასთან საუბარში
          დამეხმარება. ვიცი,რომ დასახულ მიზნებს აუცილებლად მიაღწევს,რადგან
          იმსახურებს ამ ყველაფერს.
        </p>
      }
      {
        <p className={styles.Friends_description}>
          სამი უსაყვარლესი ადამიანი უნდა დავასახელო ახლა. თაკო ანი და მარინე, აი
          ჩემი პატარა გოგოები არიან,რომლებზეც ვგიჟდები ისე მიყვარს. მათთან
          შედარებით დიდი ვარ, მაგრამ ყოველთვის მიხარია მათთან ერთად ყოფნა. ძაან
          მოსიყვარულე და ალალი ადამიანები არიან. ყოველი შემთხვევისთვის მე ასეთი
          შთაბეჭდილება მაქვს. ძალიან ბევრი მოგონება გვაქვს ერთად ტურზე ყველას.
          მარინე გავიცანი პირველი, ოღონდ ტურზე ვერ მოახერხა წამოსვლა და
          მესენჯერის მეშვეობით დავახლოვდით. ყველამ იცის,რომ გოგოებს დიდ პატივს
          ვცემ, მარინეს მიმართ უაზრო ხუმრობა არმესიამოვნა და მარინეს მხარეს
          ვიყავი, რამაც განაპირობა ის ყველაფერი, რომ დავახლოვდით და დღეს ჩემი
          პატარაა მეგობარია. თაკო ჯუთაში გავიცანი პირველად და შემდეგ ჩემი
          სურვილი იყო, რომ ბავშვებთან უფრო დაახლოებულიყო და შევთავაზე ჩვენთან
          ერთად წამოსულიყო რესტორანში, სადაც გაერთობოდა. ვიფიქრე,რომ თაკოსთვის
          და თავის დაქალისთვის კარგი იქნებოდა ,რადგან პირველ კურსელები იყვნენ და
          ყველა სახის დაძაბულობას მოიხსნიდნენ ჩვენთან. ანის, რაც შეეხება
          სიმართლე გითხრათ, არმახსოვს სად გავიცანი. მაგრამ ბევრი კარგი მოგონება
          გვაქვს ერთად. უსაყვარლესი გოგოა, განსაკუთრებით რო თვრება და სიყვარულს
          ხსნის ხოლმე, მაგრამ რატომღაც მე არც სიმთვრალეში მიხსნის სიყვარულს.
          ასევე ერთი უსაყვარლესი გოგო ნინი სტურუა გამოჩნდა ჩემს ცხოვრებაში,
          რომელმაც ძალიანი დიდი როლი ითამაშა ჩემი მდგომარეობის გამოსწორებაში.
          უსაყვარლესი ადამიანი,რომელიც არის პოზიტივის და ენერგიის
          ერთობლიობა,შეუძლებელია ამ ადამიანთან დრო გაატარო და ელემენტარული არ
          გაიღიმო მაინც. სულ მზად არის მოგისმინოს და დაგეხმაროს. არმინდა
          გამომრჩეს ადამიანების ის კატეგორია,რომლებთან ერთადაც გავიზარდე,თუმცა
          ცხოვრება ხომ იცით როგორია, ყველა რა თქმა უნდა არ რჩება ჩვენს გვერდით.
          ზოგი სხვა სტილის ცხოვრებას მიჰყვება და რაც უფრო ვიზრდებით ვეღარ ვუგებთ
          ერთმანეთს. ხოშტო ჩემი ძმა შემოვრჩით ერთმანეთს და ძალიან მიყვარს ეს
          ბიჭი.ალალი მართალი და გულიანი ადამიანი,რომელიც ყოველთვის გვერდით
          დაგიდგება.მიხარია ხოშტოს წარმატება ყოველთვის. ძალიან კარგი შეყვარებული
          ჰყავს პირადად არვიცნობ, თუმცა ხოშტოს სიყვარულში დარწმუნებული ვარ.
          ყოველთვის გამიხარდება მათი ბედნიერება და მინდა ორივემ იცოდეს თუ ოდესმე
          წაიკითხავენ ამ ჩანახატს ჩემი იმედი შეუძლიათ ჰქონდეთ ყოველთვის. არ გვაქვს ისეთი ხშირი კონტაქტი,მაგრამ ვცდილობთ ერთად ვივარჯიშოთ და ვარჯიშის დროსაც დავეხმაროთ ერთმანეთს.
        </p>
      }
    </div>,
    <div key={4} className={styles.Friends_Per}>
      <h2>თავი 4</h2>
      {
        <p className={styles.Friends_description}>
          არმინდოდა კონკრეტული სახელი გვარები მეთქვა იმიტომ, რომ ბევრი ადამიანი
          შემოვიდა ჩემს ცხოვრებაში და გარკვეული მიზეზების გამო უკან წავიდნენ,
          თუმცა არსებობენ ადამიანები,რომლებმაც მოახერხეს და დღემდე გვაქვს ძალიან
          კარგი ურთიერთობა.არ შემიძლია არ ვახსენო ადამიანი, რომელიც უკარგესი,უთბილესი და
          უკეთილშობილესი,რომლის იმედიც ყოველთვის მაქვს. შეიძლება ვერ ვახერხებთ
          ხშირ კონტაქტს,თუმცა ყოველთვის ვიცი,რომ გვერდით მეყოლება და ანალოგიურად
          იცის თვითონაც.ეს ადამიანი ლიკა ბულაცაშვილი არის და გამოჩნდა ჩემს
          ცხოვრებაში ტურზე, სადაც დაქალთან ერთად იყო წამოსული და გავიცანი, მას
          შემდეგ ეტაპობრივად ვითარდება ჩვენი ურთიერთობა და ძალიან მახარებს ეს
          ფაქტი. როგორც ავღნიშნე არ მიჭირს ადამიანების ამოცნობა. ლიკას პირველად,
          რომ შევხვდი ვიგრძენი,რომ ძალიან საყვარელი და კარგი გოგო იყო და
          დღევანდელი გადმოსახედიდან თამამად შემიძლია ვთქვა,რომ არ ვცდებოდი, ჩემი
          შთაბეჭდილება გამართლდა და იმაზე კარგი აღმოჩნდა ვიდრე მე მეგონა.
          კეთილი, საყვარელი და შრომისმოყვარე ადამიანი, რომელიც ყოველთვის ჩემს
          მხარეს იყო, როცა გვერდში დგომა მჭირდებოდა. შეიძლება თვითონ ვერ
          ხვდებოდეს,რამდენად მნიშვნელოვანია ჩემთვის ეს ადამიანი, მაგრამ ბევრს
          ნიშნავს ლიკა ჩემთვის. იმის მიუხედავად,რომ მის დაქალთან საერთოდ
          ურთიერთობა კიარა კონტაქტიც აღარ მაქვს, მე ლიკასთან ცალკე ურთიერთობა
          ჩამოვაყალიბე,რასაც დღემდე ვაგრძელებთ და დარწმუნებული ვარ, რომ ძალიან
          დიდხანს გაგრძელდება ეს ყველაფერი.
        </p>
      }
    </div>,
    <div key={5} className={styles.Friends_Per}>
    <h2>თავი 5</h2>
    {
      <p className={styles.Friends_description}>
        Შეიძლება ცხოვრებაში ნათესავი ვერ აირჩიო,მაგრამ მეგობრებს და ძმაკაცებს შენ არჩევ. Სწორედ ეს ხდება მიზეზი იმის,რომ ძალიან ბევრი გამოცდა გიწევს ცხოვრების მანძილზე. ეს გამომდინარეობს იქიდან,რომ ხშირია ადამიანების შემოდინება და გადინება შენს ცხოვრებაში. ამ ჩანახატიდანაც არის რამოდენიმე ადამიანი ამოშლილი, თუმცა მივხვდი,რომ ამოშლა არ არის სწორი.თუ ამ ჩანახატს კითხულობ და თვლი,რომ ყველა ზემოთ ჩამოთვლილ ადამიანთან მაქვს ისევ ურთიერთობა ცდები. უმეტესობასთან დღემდე ვმეგობრობ და ძალიან კარგად ვარ. არის რამდენიმე ადამიანი ამ ჩანახატში, რომელთანაც აღარ მაქვს ისეთივე ურთიერთობა,როგორიც მქონდა. Ბევრი მიზეზი შეიძლება იყოს, ალბათ გავიზარდეთ ყველანი და სხვადასხვა საკითხები უკეთესად გადავაფასეთ. ამ  ყველაფერმა საკუთარი გრაფიკი შეგვიცვალა და იმის გამო,რომ ხშირად კონტაქტი არგვქონდა ურთიერთობა დასრულდა. ავღნიშნე, ის ფაქტი,რომ ზოგი ადამიანი ამოშლილი არის, თუმცა მირჩევნია დავტოვო ჩანახატში  და რამდენიმე წლის შემდეგ ვნახო ვისთან მქონდა კონტაქტი.
      </p>
    }
    {
      <p className={styles.Friends_description}>
მთავარი არის ის ფაქტი,რომ ჩხუბით და აგრესიით არავისთან დამისრულებია ურთიერთობა. უბრალოდ ცხოვრების ჩვენებურად განვითარება მოვინდომეთ და სხვადასხვა გზებით წავედით ამ მიზნის შესრულებისკენ. ყოველი შემთხვევისთვის არცერთ ადამიანთან არვნანობ ურთიერთობას,რადგან კარგად ვისწავლე რას ნიშნავს ნამდვილი მეგობარი და ვის შემიძლია ვენდო. Ზუსტად ვიცი ვის უნდა დავუძახო ძმაკაცი და მეგობარი. შეიძლება ძალიან ბევრ ადამიანთან მაქვს კონტაქტი და კარგი ურთიერთობა, მაგრამ ეს ყველაფერი არ ნიშნავს იმას,რომ ამ ადამიანს მეგობარს ან ძმაკაცს ვეძახი.

      </p>
    }
    {
      <p className={styles.Friends_description}>
Ხშირად მქონია მომენტი,როდესაც ადამიანთან დავიწყე ჩვეულებრივი კარგი ურთიერთობა,თუმცა ძალიან მალევე თავი ჩემ ძმაკაცად ჩათვალა და ისე უხუმრია,რომ ყურადღება გამიმახვილებია მაგაზე და ადამიანურად მითქვამს,რომ არ არის ეს სწორი, რადგან არის გარკვეული სახის ხუმრობები,რომელსაც ძმაკაცსაც არ გავუტარებ. ამიტომ ის ფაქტი,რომ გარკვეული ზღვარი არსებობს,სანამ ძმაკაცი გახდება ადამიანი ჩვეულებრივი მომენტია. ძმაკაცები ყოველ სიტყვაში,რომ შეურაცხყოფას აყენებენ ერთმანეთს არც ეგ ზის ჩემს პიროვნებაში. შეიძლება უთხრა ხუმრობით და იცინოთ, მაგრამ ეს ყველაფერი რო სისტემატიურ სახეს იღებს, ძალიან მიუღებელი არის ჩემთვის. 
      </p>
    }
  </div>,
  ];

  const divsPerPage = 2;
  const totalPages = Math.ceil(divs.length / divsPerPage);
  const startIndex = (currentPage - 1) * divsPerPage;
  const endIndex = startIndex + divsPerPage;

  const currentDivs = divs.slice(startIndex, endIndex);

  return (
    <div>
      {currentDivs.map((div, index) => (
        <div key={index} className="content">
          {div}
        </div>
      ))}
      <div className="pagination">
        {Array.from({ length: totalPages }, (_, index) => (
          <button
            key={index + 1}
            onClick={() => handlePageChange(index + 1)}
            className={currentPage === index + 1 ? "active" : ""}
          >
            {index + 1}
          </button>
        ))}
      </div>
    </div>
  );
};

export default Friends;
