import React, { useState } from "react";
import styles from "../aboutme/About.module.css";

const AboutMe = () => {
  const [currentPage, setCurrentPage] = useState(1);

  const handlePageChange = (page) => {
    setCurrentPage(page);
  };

  const divs = [
    <div key={1} className={styles.about_me}>
      <h2>თავი 1</h2>
      {
        <p className={styles.about_description}>
          არდავიწყებ ძაან ოფიციალურად ჩანახატს, პირდაპირ გადავალ პატარა
          ისტორიების მოყოლით, რომელიც შეიძლება ვინმესთვის უმნიშვნელო იყოს და
          მინიმალისტური, მაგრამ სწორედ ეს მინიმალისტური დეტალებია,რაც
          ბედნიერების შეგრძნებას გვანიჭებს ადამიანებს. დავიწყებ სკოლის
          პერიოდიდან და ძალიან მოკლედ ვიტყვი,რომ დღევანდელი მუროსგან რადიკალურად
          განსხვავებული ვიყავი, ბუნჩულა და საყვარელი ბავშვი,რომელიც არასდროს
          ჩხუბობდა და ყველანაირ ღადაობას ატარებდა. დადგა დრო, როცა სტუდენტი
          გავხდი და სრულიად შეიცვალა ჩემი ცხოვრება, საერთოდ სხვა მურო ბედიანიძე
          გავიცანი მეც და ადამიანებმაც ისეთი გამიცნეს, როგორიც რეალურად
          ვყოფილვარ. სანამ უნივერსიტეტის ცხოვრებაზე გადავალ, იმას ვიტყვი,რომ 6
          წლიდან მოცეკვავე ვიყავი,რომ გავიზარდე სულ ვჩხუბობდი აღარ მინდა ცეკვა
          და ძალით დავდივართქო. მეგონა, რომ ამ ყველაფერზე კარგად დაფიქრებული
          ვიყავი და გააზრებული მქონდა, თუმცა ცეკვის კარიერა,რომ დავასრულე სწორედ
          მაშინ მივხვდი,საერთოდ არმიფიქრია იმ თემაზე, რომ 12 წელი ცეკვაზე
          სიარული, უბრალოდ წყალში ჩავყარე. ახლა რაც შეეხება უნივერსიტეტს,
          მისვლის დღიდან ძალიან გახსნილი ბიჭი ვიყავი და ვცდილობდი, რომ ახალი
          ადამიანები გამეცნო და ასეც მოხდა უნივერსიტეტის პერიოდში იმდენი
          ადამიანი გავიცანი, დავმეგობრდით, შემდეგ დავიშალეთ, როგორც ხდება ხოლმე,
          ადამიანები მიდიან და მოდიან შენი ცხოვრებიდან. დავიწყე უნივერსიტეტის
          ტურებზე სიარული და ვიგრძენი, რომ ძალიან ბევრ ადამიანს უხაროდა ჩემი
          დანახვა, ბევრსაც მოვწონდი, თუმცა არასდროს ვფიქრობდი, რომ შეიძლებოდა
          ვინმესთან ურთიერთობა დამეწყო, მაგრამ ყველამ ვიცით,რომ სიყვარული და
          გული ისეთი რამ არის,რასაც ვერ ვუბრძანებთ ვერაფერს. სწორედ ამ დროს
          გამოჩნდა ჩემ ცხოვრებაში გოგო,რომელთან ერთად ყოფნის დროს იმდენად
          კომფორტულად ვგრძნობდი თავს, რომ ვერ გადმოვცემ სიტყვებით. თან არასდროს
          არმყვარებია და არვიცოდი ეს გრძნობა რას ნიშნავდა. გარკვეული დროის
          შემდეგ ვხვდებოდი, რომ ამ ადამიანს იმდენად მივეჩვიე, რომ ვეღარ ვძლებდი
          მასთან ლაპარაკის,მიწერის ან ნახვის გარეშე. შემდეგ გარკვეული მიზეზების
          გამო შევწყვიტეთ ურთიერთობა, რასაც ჩემთვის პირადად ორი მხარე აქვს,
          დადებითიც და უარყოფითიც. ერთი მხარე ის არის, რომ ძალიან რთული იყო სხვა
          რამეზე ყურადღების გადატანა, თუმცა ყველა ურთიერთობიდან მინიმალისტური
          დეტალები მაინც უნდა შევისწავლოთ. ამ შემთხვევაშიც ასე მოხდა, მივხვდი,
          რომ ყველა ადამიანი გულთან ახლოს არუნდა მიუშვა და არუნდა ენდო ყველას,
          რადგან შეიძლება ისეთ მომენტში დაგტოვონ მარტო,როცა ყველაზე მეტად
          გჭირდება. ჩემ შემთხვევაში ამ გოგოს შემდეგ არავინ მომწონებია ისე, რომ
          ურთიერთობა დავიწყო. მგონია,რომ ისევე დასრულდება ურთიერთობა,როგორც წინა
          და ამ ყველაფრის შემდეგ საერთოდ არ შევიყვარებ არავის. თემიდან
          გადავხტები და ისევ იმ მომენტს ვუბრუნდები, როცა უნივერსიტეტში ახალი
          მისული ვიყავი და ძალიან ადვილად შევდიოდი კონტაქტში და მეგონა რო ყველა
          ადამიანი ვისაც გავიცნობდი და დავუახლოვდებოდი ბოლომდე მეყოლებოდა
          გვერდში, თუმცა ამ 4 წლის განმავლობაში რამდენი ადამიანი შემოვიდა ჩემს
          ცხოვრებაში და შემდეგ ისევ წავიდა ვერ დავთვლი, რადგან შეუძლებელია.
        </p>
      }
    </div>,
    <div key={2} className={styles.about_me}>
      <h2>თავი 2</h2>
      {
        <p className={styles.about_description}>
          მინდა,რომ ძალიან ბევრი ვისაუბრო, მაგრამ არმიყვარს ჩემთავზე საუბარი,არც
          ადამიანებთან და როგორც ჩანს არც ჩანახატებში. კიდევ ერთი უინტერესო დღე,
          9 ნოემბერი 2022 წლის. ზუსტად 7 თვე არის სამსახურს თავი დავანებე და
          იმის შემდეგ, ძალიან შეიცვალა ჩემი ცხოვრება, ყოველი დღე ერთმანეთს
          დაემსგავსა,რაც ძალიან არმწომწონს,რადგან ვინც მიცნობს ყველამ იცის,რომ
          ერთფეროვნება არმიყვარს. სწორედ ეს არის პერიოდი,როდესაც ჩემი თავის
          საუკეთესო ვერსია გავხდი, ფინანსურად ვიყავი იმდენად იდეალურად,რომ რისი
          სურვილიც გამიჩნდებოდა, დაუფიქრებლად ვყიდულობდი. თუმცა ძალიან კარგი
          მოგონებები დამრჩა. ადამიანი ვიყავი,რომელიც ფიქრობდა იმ ფაქტზე,რომ
          შეიძლება მეორე დღეს ვეღარ გაიღვიძო და რისი სურვილიც გექნება ყველაფერი
          უნდა გააკეთო. შეიძლება ითქვას,რომ ისევ ისეთი ვარ,თუმცა დღესდღეობით
          მაქვს მომენტები,როცა მომავალზე ფიქრი მაწვება და არვიცი რაუნდა ვქნა და
          ან რაიქნება მომავალში. ალბათ ეს ყველაფერი იმიტომ ხდება,რომ ვიზრდები
          ნელნელა და უფრო მეტად ვაქცევ ყურადღებას ისეთ საკითხებს როგორიცაა:
          მომავალი,ოჯახი, ბავშვი და კიდევ მრავალი. მომავალი ამ ყველაფერს
          მოიაზრებს, მაგრამ მაინც დავაკონკრეტე.უჩვეულო ჩანახატში ბოლო ცვლილების
          შემდეგ გასულია 2 თვე. დღეს არის 17 იანვარი და შეგრძნება მაქვს
          ისეთი,რომ საერთოდ სხვა მურო ბედიანიძე წერს გაგრძელებას,დავიწყოთ
          იქიდან,რომ ამ 2 თვეში ძალიან ბევრი ცვლილება იყო ჩემს
          ცხოვრებაში.პირველრიგში დავიწყე ჩემით სწავლა Front-end-development
          ის,რომელიც ძალიან დიდხანს მაინტერესებდა,ერთი პერიოდი უნივერსიტეტიდან
          გადასვლას ვფიქრობდი,თუმცა ვიფიქრე ფინანსების განხრითაც მქონოდა
          დიპლომი. იმის შემდეგ,რაც გადავდგი ეს ნაბიჯი და ჩემი ინტერესის სფეროს
          შესწავლა დავიწყე მივხვდი,რომ ძალიან მონდომებული ვიყავი,თუმცა მერჩივნა
          ეს სწავლა ვალდებულებად მექცია და 11 იანვარს დავიწყე პროგრამირების
          კურსი,რომელიც ძალიან მომწონს. ვფიქრობ,რომ ჩემი თავის მოტივაცია და
          შემართება ამ საქმეში ვიპოვნე და არვაპირებ დანებებას. ყოველთვის
          ვიძახი,რომ შრომა ფასდება და ძალიან დიდ იმედს ვიტოვებ,რომ ეს ჩემი
          შემართება,მოტივაცია და ამ საქმისადმი შრომისმოყვარეობა დამიფასდება. ამ
          ყველაფრისთის გარკვეული შეზღუდვები დავუწესე ჩემთავს და რაღაც საკითხები
          უკან დავხიე ჩემს ცხოვრებაში. ჩემი აზრით სჯობს,რომ ეს პერიოდი
          გამოვიყენო ჩემი თავის განვითარებისთვის. დაზეპირება არჭირდება ამ
          სფეროს, სულ ვცდილობ,რომ ვივარჯიშო და ნასწავლი კოდები პრაქტიკაში
          გამოვიყენო და შევქმნა რაიმე რენდომ საიტი.ეს ყველაფერი მეხმარება
          იმაში,რომ გავიგო ყველაფერი და გავიაზრო. ასევე თამამად შემიძლია
          ვთქვა,რომ ჩემი ყოფილის კვალი ჩემს ცხოვრებაში საერთოდ გაქრა და
          ვფიქრობ,ერთ-ერთი ფაქტორი ესეც არის,რომ ფსიქოლოგიურად დავლაგდი. ამ
          შემართებით და მოტივაციით თუ გავაგრძელე ის ყველაფერი,რაც ჩანაფიქრი
          მაქვს ალბათ მურო ბედიანიძის საუკეთესო ვერსია გავხდები ისევ
        </p>
      }
      {
        <p className={styles.about_description}>
          მოკლედ დღეს არის 21 იანვარი.ვერ ვიტყვი,რომ ცუდი დღე მქონდა. უნდა
          ავღნიშნო,რომ კიდევ ერთი გათენებული ღამის შემდეგ,საკმაოდ დამღლელი დღე
          მქონდა. ჩემი დასახული მიზნებისთვის ბრძოლაში გავლიე ეს დღეც და ჩემი
          აზრით ეს შრომა,მოტივაცია და მონდომება არ უნდა ჩამეყაროს
          წყალში.დაბადებისდღეზე ვარ ახლა თუმცა სურვილი გამიჩნდა,რომ უფრო მეტად
          გადმოვცე ჩემი შინაგანი მდგომარეობა და დავანახო მუროს,რომ თურმე
          ცხოვრების გაგრძელება შესაძლებელია და ხელი არუნდა ჩაიქნიოს არაფერზე.
          ასევე მინდა რო ამ ჩანახატის მკითხველმაც დაინახოს,რომ გადაუჭრელი
          პრობლემა არ არსებობს.ჩვენს შინაგან მდგომარეობაზე არის დამოკიდებული
          ყველაფერი და როდესაც მივხვდებით, რომ ჩვენ თავს სწორი მიმართულებით
          ვუშვებთ,ხელი არუნდა შევუშალოთ და მივცეთ უფლება,რომ გამოცადოს ეს
          გზაც.ძალიან კარგი გეგმები გვაქვს სამეგობროს და რატომღაც, გული
          მიგრძნობს,რომ ეს ყველაფერი ერთ-ერთი საუკეთესო მიმართულება იქნება ჩემს
          ცხოვრებაში.ვინც მიცნობს გაუკვირდება ჩემი საუბარი,რადგან 1 წლის წინ
          საერთოდ სხვა ადამიანი ვიყავი ამ საკითხში. ცხოვრებაზე ხელი ჩავიქნიე და
          მეგონა,რომ არაფერი აღარ გამოვიდოდა ამ ცხოვრებაში. მაგრამ ყველას
          ცხოვრებაში არის გარდამტეხი მომენტი და მეც ეგ მომენტი მქონდა და საერთოდ
          შევიცვალე დამოკიდებულება ბევრ საკითხთან დაკავშირებით. 2022 წლისგან
          განსხვავებით ახლა გადავწყვიტე,რომ 2023 წელი დავუთმო ჩემი თავის
          განვითარებას ბოლომდე და საერთოდ სხვა ადამიანი გავხდები.მივხვდი,რომ
          წარსული უბრალოდ მოგონებებია,რომელიც ტკბილად უნდა
          გავიხსენო.დანარჩენი,რამაც შეიძლება ჩემს ფსიქოლოგიურ მდგომარეობას ავნოს
          უნდა დავიკიდო და არმივაქციო ყურადღება.
        </p>
      }
      {
        <p className={styles.about_description}>
          შეიძლება ადამიანს ძალიან უინტერესო მოეჩვენოს ეს ჩანახატი,რადგან უამრავ
          თემაზე გადახტომა არის და ძალიან ბევრ რამეს კითხულობ, თუმცა ამ
          მინიმალისტური ისტორიებით იქმნება ერთი დიდი ისტორია,რომელსაც მურო
          ბედიანიძის ცხოვრება ჰქვია. ვფიქრობდი და ეს ყველაფერი მხოლოდ მოკლე
          ისტორიაა. ნელნელა დავიწყებ თითოეული ადამიანის დახასიათებას და ჩვენი
          მოგონებების დაწერას და იმედი მაქვს,რომ ოდესმე თუ ვინმე ამას წაიკითხავს
          ესიამოვნება.ბოლო ცვლილების შემდეგ დიდი დრო არის გასული და თამამად
          შემიძლია ვთქვა,რომ საკუთარ თავთან ბრძოლა მოვიგე და Overthinking
          დავასრულე, შეიძლება ბოლომდე ვერ ქრებოდეს ეგ ყველაფერი, თუმცა მომავალზე
          ფიქრს აღარ ვაძლევ საშუალებას,რომ აწმყოში ბედნიერების მიღებაში
          შემიშალოს ხელი. ძალიან კარგად გავიაზრე ის ფაქტი,რომ როგორც მომავალზე
          არღირს ბევრი ფიქრი ასევეა წარსული. მივედი იმ დასკვნამდე,რომ აზრი არ
          აქვს წარსულში ჩადენილი შეცდომის გამო საკუთარ თავს არ აძლევდე
          საშუალებას მიიღოს ყოველი წამით მუხტი და ბედნიერება. საკუთარ თავთან
          ვაღიარე, რომ თუ წარსულში არის ისეთი ფაქტი მომხდარი,რომელსაც ვეღარ
          შევცვლი აზრი აღარ აქვს ამ ფაქტზე ბევრ ფიქრს და თავის ტანჯვას, ხოლო თუ
          ეს შეცდომა გამოსწორებადია მითუმეტეს არღირს ბევრი ფიქრი და საკუთარი
          თავის ტანჯვა. ძალიან დიდი ხანი ვებრძოდი ჩემ თავს იმიტომ,რომ წარსულსა
          და მომავალს შორის ვიყავი გაჩერებული და მიჭირდა აწყმოში დაბრუნება,
          შეიძლება ადამიანის გვერდით ვყოფილიყავი თუმცა ფიქრებით სულ სხვა ადგილას
          ან თუნდაც სხვა სამყაროში ვიყავი. მაგრამ როგორც ყოველთვის მეუბნებოდნენ
          საკუთარ თავს მხოლოდ ჩვენ ვშველით, იმის მიუხედავად,რომ ექიმის
          დანიშნულებით წამლებს ვსვამ დამამშვიდებლებს, მაინც ჩემთავს მეთვითონ
          ვუშველე და მივახვედრე,რომ ძალიან ცუდად მოქმედებდა ეს ყველაფერი მურო
          ბედიანიძეზე. ვიცოდი,რომ ასე გაგრძელება არ შეიძლებოდა,რადგან ბოლო
          პერიოდში ძალიან შევიცვალე, ხანდახან მეგონა,რომ სულ სხვა ადამიანი
          ვიყავი, თუმცა ვფიქრობ,რომ ყველაფერი უნდა მომხდარიყო ამ ცხოვრებაში,
          რათა დღესდღეობით ჩემითავის საუკეთესო თუარა ერთ-ერთი ყველაზე კარგი
          ვერსია ვყოფილიყავი
        </p>
      }
    </div>,
    <div key={3} className={styles.about_me}>
      <h2>თავი 3</h2>
      {
        <p className={styles.about_description}>
          უფრო და უფრო ვხვდები რომ ეს ცხოვრება სავსეა სხვადასხვა სახის
          სიურპრიზებით. ისეთი რამ გამოცვადე ამ ბოლო დროს ბევრი ადამიანისგან,რომ
          მეც არვიცი რა დავარქვა. სიმართლე როვთქვა მგონია,რომ ამ ადამიანებმა
          უბრალოდ გაიაზრეს ის ფაქტი თუ რამდენად კარგი ადამიანი დაკარგეს ჩემი
          სახით და დააფასეს მათთან ერთად გატარებული დრო. სცადეს ჩემთან ემოციური
          თამაშიც,რაც ნამდვილად გამოუვიდათ თავიდან, თუმცა ოვერსინქინგის
          დასრულების გამო, არდამიწყია ბევრი ფიქრი იმ საკითხზე,რომ დამნაშავე ვარ
          ან რაიმეს გამოსწორება არის შესაძლებელი. რა თქმა უნდა დავფიქრდი,რომ არ
          არსებობს ადამიანი ვისაც შენი სიბრაზე და ნერვების მოშლა უნდა
          აჩვენო,რადგან არცერთი ადამიანი არ იმსახურებს იმის ნახვას,რომ მათ შენი
          გაბრაზება მოახერხეს.
        </p>
      }
      {
        <p className={styles.about_description}>
          ალბათ 1 თვე გავიდა ბოლო ცვლილებიდან და რა თქმა უნდა კიდევ ბევრი რამ
          მოხდა ჩემს ცხოვრებაში. უფრო მეტად ვცდილობ საკუთარი თავის განვითარებას.
          დღესდღეობით არ შემიძლია იმის თქმა,რომ ჩემი თავის საუკეთესო ვერსია
          ვარ,თუმცა ვთვლი,რომ ამჟამად ერთერთი ყველაზე კარგი ვერსია ვარ იმასთან
          შედარებით რაც ვიყავი. ბევრი რამ გადავხარშე ისე როგორც საჭირო იყო და იმ
          მოგონებებთან ერთად ვცხოვრობ რომლებიც ერთ დროს ძალიან კარგი იყო,თუმცა
          ახლა არც ისე კარგად მახსენდება.ეს ყველაფერი არნიშნავს იმას,რომ ვნანობ
          მათთან ურთიერთობას ან იმ გატარებულ წუთებს. უბრალოდ დავიკიდე ეს ხალხი
          ძალიან ჩვეულებრივად. ზუსტად ვიცი და გავიაზრე,რომ წასასვლელი უნდა
          წავიდეს და ვინც საჭიროა ის ყოველთვის ჩემს გვერდით იქნება. ადამიანებს
          ჰგონიათ,რომ ყოველდღიური მიმოწერით განისაზღვრება მეგობრობა და
          ძმაკაცობა, არა რა თქმა უნდა არ აქვს მნიშვნელობა. უბრალოდ ადამიანისგან
          უნდა დაინახო ინიციატივა საუბრის წამოწყების და შენთან მოწერის. ძალიან
          ბევრი ადამიანი დავკარგე ამ მიზეზით,რადგან მხოლოდ ჩემი ინიციატივით
          იწყებოდა დიალოგი,შეიძლება არიყოს გამაღიზიანებელი ვინმესთვის,მაგრამ მე
          ასეთ ადამიანთან ურთიერთობა მბეზრდება და ვწყვეტ.
        </p>
      }
      {
        <p className={styles.about_description}>
          არსებობს კიდევ ერთი საკითხი,რომელიც ყველას ცხოვრებაში
          უმნიშვნელოვანესია. ვფიქრობ,რომ ჯერ ადრეა სერიოზული ურთიერთობების
          დაწყების და ზედმეტი პასუხისმგებლობის აღებისათვის. ზოგადად ყველა
          ადამიანი ვინც მიცნობს იცის,რომ ქალბატონებს ძალიან დიდ პატივს ვცემ. არ
          დავიწყებ იმის ახსნებს თუ რით გამოვხატავ ამ ყველაფერს, რადგან მხოლოდ
          საუბარი არაფერია მთავარია მასთან ერთად შენმა ქცევამ აჩვენოს და
          გამოხატოს შენი გრძნობები. ჩემი აზრით ჯერ ვერ აფასებენ ამ თვისებას
          ჩემში,მაგრამ გამოჩნდება ის ადამიანი ჩემს ცხოვრებაში ვინც ამ ყველაფერს
          დააფასებს და დამიჯერეთ უბედნიერესი ადამიანი იქნება. ამ თემაზე საუბარი
          არნიშნავს იმას,რომ გული მწყდება ან სიყვარულს ვეძებ,არა სიყვარულს ძებნა
          არსჭირდება თავისით შემოვა ჩვენს ცხოვრებაში.შეიძლება ადამიანი ისე
          შეგიყვარდეს ვერც კი მოასწრო გააზრება. უბრალოდ არის ხშირად მომენტი როცა
          გაურკვევლობაში ხარ. ადამიანებმა ბევრი ნერვიულობის და დეპრესიების
          გარეშე უნდა ვისწავლოთ ცხოვრებიდან მეგობრებისა და გოგოების გაშვება. ის
          ადამიანები, რომლებიც ვერ გვაფასებენ და არ იმსახურებენ ჩვენთან
          ურთიერთობას.
        </p>
      }
    </div>,
    <div key={4} className={styles.about_me}>
      <h2>თავი 4</h2>
      {
        <p className={styles.about_description}>
          ბოლო ცვლილებიდან გასული არის ძალიან დიდი ხანი, მინიმუმ 6 თვე.
          დღევანდელი გადმოსახედიდან ჩემ გავლილ წლებთან შედარებით საერთოდ სხვა
          ადამიანი ვარ. საკუთარ თავთან საერთოდ ყველაფერი დავალაგე და საკუთარ
          ქვეცნობიერთან ჰარმონიაში ვარ, რაც ძალიან მახარებს. ამჟამად საერთოდ
          სხვა ფიქრები მაქვს და ეს ყველაფერი მოიაზრებს იმას, რომ ისევ საკუთარი
          თავის განვითარეაბს ვუთმობ დროს 2024 წელს. ფიტნესი და ძილის რეჟიმის
          დალაგება,რაც წონის მომატებაში და კარგი ფორმის მიღებაში დამეხმარება.
          ასევე ვთვლი,რომ შესაძლებელია ამჟამად კარიერულად არეული ვარ და ბევრი
          რამ ხდება, თუმცა აუცილებლად დალაგდება ყველაფერი. მხოლოდ დეველოპერობით
          არ განისაზღვრება ყველაფერი. თუ შევძელი და ამ სფეროთი დავიწყე მუშაობა
          ძალიან გამიხარდება, რადგან საკმაოდ ბევრი რესურსი ჩავდე ამ ყველაფრის
          შესწავლაში, თუმცა თუ არ დავიწყე ამ სფეროთი მუშაობა, არასდროს ვინანებ
          ამ ყველაფერს. პირველ რიგში იმიტომ,რომ ჩემი ინტერესის სფერო იყო
          ყოველთვის და შევძელი,რომ ეს ყველაფერი შემესწავლა და საკუთარი პროექტები
          გამეკეთებინა. მეორე მიზეზი რის გამოც არასდროს ვინანებ არის ის,რომ
          ყველაზე რთულ პერიოდში გადავწყვიტე ამ ყველაფრის შესწავლა და რაღაც მხრივ
          ეს ყველაფერიც დამეხმარა,რომ სხვა ადამიანი გავმხდარიყავი. 17 დეკემბერი
          არის დღეს ერთი ჩვეულებრივი საღამო და ვფიქრობ,რომ ძალიან ცოტა დრო რჩება
          იქამდე სანამ საკუთარ თავს გარდავსახავ სხვა ადამიანად, რა თქმა უნდა
          ცვლილება პიროვნულობაზე არ აისახება და ხასიათზე, უბრალოდ ეს ყველაფერი
          საკუთარი თავის განვითარებისთვის არის საჭირო. რაც შეეხება ჩემს დიდიხნის
          წინანდელ დამოკიდებულებას შეიცვალა. არ ვიტყვი, რომ სრულად შევცვალე ეგ
          დამოკიდებულება, მაგრამ რაც გავიზარდე, უფრო მეტად ვხვდები,რომ მომავალზე
          ფიქრი საჭიროა. დღესდღეობით სულ ვცდილობ,რომ სამსახური ვიშოვნო და ჩემს
          მომავალზე ზრუნვა დავიწყო. წარსულში ბევრად განსხვავებული ვიყავი. მხოლოდ
          აწმყო მაინტერესებდა და შემეძლო ერთ დღეში დამეხარჯა მთელი ფული, რაც
          მქონდა. ამ ყველაფრის შეცვლაც ვფიქრობ,რომ საბოლოოდ კარგად აისახება ჩემს
          მომავალზე. ყოველთვის მივიწევ იმისაკენ,რომ საკუთარი თავის საუკეთესო
          ვერსია გავხდე და ვფიქრობ რომ უკვე გავიმარჯვე. არა იმაში,რომ ვინმეზე
          მაგარი ვარ ან საუკეთესო ვარ, არა უბრალოდ მე წარსულ მურო ბედიანიძეზე
          ბევრად მაღლა ვდგავარ და მას მოვუგე ეს ბრძოლა
        </p>
      }

      {
        <p className={styles.about_description}>
          დავიწყებ იქიდან საუბარს,რომ ბოლო ცვლილებებში რა თემებზეც მქონდა
          საუბარი ყველაფერს სწორად მივყვები.იმის შემდეგ დავიწყე ფიტნესზე და
          აუზზე სიარული, ძალიან მონდომებით და შემართებით. არ ვაცდენ არცერთ დღეს,
          ყოფილა შემთხვევები,რომ მეზარებოდა მაგრამ საკუთარი თავისთვის
          დამიძალებია და მაინც ძალიან კარგად ვივარჯიშე. შინაგანადაც მშვიდად ვარ,
          არვაძლევ საკუთარ თავს იმის საშუალებას,რომ ისევ ისე ემოციურად მიიტანოს
          ყველაფერი გულთან და დაისტრესოს თავი. კარიერას რაც შეეხება, ვცდილობ
          საკუთარი თავი ვიპოვნო ისეთ სფეროში,სადაც თავს კომფორტულად ვიგრძნობ.
          2024 წლის მაისში მაქვს გამოცდა თიბისი აკადემიაში თუ ჩავაბარე, მაშინ
          ვიფიქრებ,რომ ეს სწავლა და განვლილი პერიოდი ღირდა ამ ყველაფრად, მაგრამ
          თუ ვერ ჩავაბარე მაინც არც ერთი წამით არ ვინანებ იმას,რომ დეველოპერობა
          დავიწყე. ერთი მიზეზი არის ის,რომ ჩემთვის ყველაზე ცუდ პერიოდში დავიწყე
          და დამეხმარა ამ პერიოდის დაძლევაში და მეორე მიზეზი ის არის,რომ
          შემიძლია ჩემთვის სასურველი დიზაინები შევქმნა, მინიმუმ ეს
          ჩანახატი,რასაც ახლა კითხულობთ. ზუსტად 1 თვის წინ ერთი ჩვეულებრივი დღე
          იყო,როცა სამსახურიდან ვისვენებდი და არაფერი განსაკუთრებული არ ხდებოდა.
          დილით,რომ გავიღვიძე უბრალოდ ჩემი გიტარა ავიღე და დავიწყე დაკვრა. ორი
          სხვადასხვა სიმღერის აკორდები ავურიე ერთმანეთში და ნელნელა სიმღერა
          დავიწყე. საერთოდ არმეგონა,რომ სიმღერის დაწერა შეიძლებოდა, თუმცა ერთ
          სიტყვას მეორე სიტყვა მოჰყვა და უჩვეულო ჩანახატთან ერთად უჩვეულო
          სიმღერა დაიწერა.ვფიქრობ,რომ არაფერი განსაკუთრებული არ არის, მაგრამ
          როცა მეგობრებთან ერთად შევასრულე ძალიან მოეწონათ და ამ ყველაფერმა უფრო
          დიდი მოტივაცია მომცა და გამიჩინა სურვილი,რომ კიდევ ვცადო სიმღერის
          დაწერა.
        </p>
      }
    </div>,
    <div key={5} className={styles.about_me}>
      <h2>თავი 5</h2>
      {
        <p className={styles.about_description}>
          არ დავიწყებ კონკრეტული თარიღის დასახელებით და იმაზე ხაზის გასმით თუ
          როდის ვწერ ამ ყველაფერს. ერთი უბრალოდ მზიანი დღე არის და ცხოვრებაც
          ისევ რუტინულად მიდის. ბევრი, რამ შეიცვალა ბოლო პერიოდში და ძალიან
          მიხარია. როგორც უკვე ავღნიშნე დავიწყე ვარჯიში და უფრო კარგად გავიაზრე
          ის ფაქტი,თუ რამდენად ძლიერი ნებისყოფა მაქვს. არვჩერდები წინ კიდევ დიდი
          გზაა. 2024 წელი საკუთარი თავის განვითარების და საუკეთესო ვერსიად
          გახდომის წელი უნდა იყოს ჩემთვის,სწორედ ეს მიზანი დავისახე წლის
          დასაწყისში და კარგად მივყვები. ძალიან ხშირად მქონდა overthinking-ი
          ,თუმცა ეს ყველაფერი უმეტეს წილად დავძლიე და ნეგატიური ფიქრები აღარ
          მაქვს. გარკვეული დროის შემდეგ მურო, რომ წაიკითხავს ამ ჩანახატს
          ვეტყვი,როცა უკან მიიხედავ, როცა შენს წარსულს თამამად შეხედავ,
          ერთადერთი რამ,რაც მართლა მნიშვნელოვანია,არის ის - იყავი თუ არა
          ბედნიერი,გაატარე თუ არა შენი ცხოვრების დიდი დრო სწორ ადამიანებთან და
          გახადე ზოგჯერ ძალიან უსამართლო ცხოვრება-მშვენიერი.
        </p>
      }
      {
        <p className={styles.about_description}>
          მშვენიერი მაშინ არის ეს ცხოვრება,როცა ჩვენს უდიდეს დროს, სწორ
          ადამიანებს ვუთმობთ,როცა საკუთარი თავები ვართ ყველგან და ყოველთვის.
          ამასამას იმიტომ გეუბნები,რომ როცა შენს დღევანდელ დღეს
          გაიხსენებ,ერთადერთი რამ იქნება მნიშვნელოვანი-უთმობდი თუ არა შენს დროს
          იმ ადამიანებს,ვისაც მართლა უყვარდი. იმედი მაქვს, რომ იმ ადამიანებთან
          შევინარჩუნებ ურთიერთობას, ვისთანაც ახლა მაქვს,რადგან ვფიქრობ მთელი
          ცხოვრების განმავლობაში, ვინც გვერდით მყოლია, ყველაზე სწორ ადამიანებთან
          ამ პერიოდში ვარ. ჯერ მეოთხე თვე არის 2024 წლის მაგრამ საკუთარი თავის
          მწამს და ვიცი რამდენად მეყოფა ნებისყოფა და რამდენად შრომის მოყვარე
          ვარ. არ გავჩერდები მთელი წელი, ძალიან დიდი სურვილი მაქვს,რომ MMA-ზე
          ვარჯიში დავიწყო უბრალოდ მოყვარულის დონეზე და ვიზამ აუცილებლად. ამიტომ
          აქვე გეტყვი მურო, რომ შენ ეს შეძელი და საუკეთესო თუ არა ერთერთი
          ყველაზე მაღლა მდგომი ვერსია გახდი საკუთარი თავის.
        </p>
      }
      {
        <p className={styles.about_description}>
          საკუთარ თავზე მუშაობას და განვითარებისკენ სწრაფვას ნელნელა შედეგი
          აქვს, ამ ყველაფერმა ფსიქოლოგიური მდგომარეობაც დამილაგა. ძალიან მშვიდად
          ვგრძნობ თავს, აღარ ვბრაზდები ისე ადვილად, არც ნერვებს ვიშლი უაზროდ,
          არავის ლაპარაკს არ ვაქცევ ყურადღებას და მითუმეტეს ისეთი ადამიანისას
          ვის დონემდეც არასდროს დავეცემი. მოკლედ,რომ ვთქვა გაბრაზების ეტაპი
          ამოგდებულია ამ პერიოდიდან, ძალიან მშვიდად ვუსმენ ყველას, სანამ პირადად
          არ შემეხებიან, ამ შემთხვევაშიც თუ ვხვდები,რომ აზრი არ აქვს ამ
          ადამიანთან საუბარს შეიძლება გამოვერიდო. იმიტომ,რომ ეგეთ ადამიანთან
          ჩხუბსაც აზრი არ აქვს. გაბრაზების ეტაპის ამოგდება კიდე იმას ნიშნავს,რომ
          მშვიდი მურო პირდაპირ ფეთქდება და ეგ არც ისე სასიამოვნო მომენტია.
        </p>
      }
    </div>,
     <div key={6} className={styles.about_me}>
     <h2>თავი 6</h2>
     {
       <p className={styles.about_description}>
         ახლა შევეხები თემას,რომელიც ძალიან მირევს ფიქრებს და ჩემს ცხოვრებას არ აძლევს უფრო მეტად განვითარების უფლებას.  20 წლიდან დავიწყე მუშაობა და იმის შემდეგ ძალიან ბევრი სამსახური გამოვიცვალე. საკუთარი თავის ძიების პროცესში ვარ 20 წლიდან და დღემდე ვერ ვიპოვნე. იმის მიუხედავად,რომ ფინანსები დავამთავრე არანაირი გამოცდილება არმქონია ამ განხრით და ვფიქრობ,რომ არც იქნება ჩემთვის სასიამოვნო ამ განხრით მუშაობა. როცა არ გსიამოვნებს ის, რასაც აკეთებ მხოლოდ ფინანსური მდგომარეობის გამო არ იზამ. პირადად ჩემთვის ასეა.  უნივერსიტეტის შემდეგ დავიწყე პროგრამირების სწავლა და აკადემიაც საკმაოდ წარმატებით დავამთავრე, თუმცა დღემდე ვსწავლობ ჩემით. დოკუმენტაციებს ვკითხულობ, ვიდეო ლექციებს ვუყურებ და ასე ვცდილობ საკუთარი ცოდნა გავიღრმავო ამ სფეროში. თუმცა ამდენი ხანია  დეველოპერობის კუთხით სამსახური ვერ ვიშოვნე. იმის მიუხედავად, რომ უფასო სტაჟირებაზეც თანახმა ვარ, იმიტომ, რომ ვგრძნობ ეს სფერო მომწონს და ამ პერიოდს გამოვიყენებ იმისათვის,რომ უფრო მეტი ცოდნა მივიღო. საკუთარ თავში ყოველთვის დარწმუნებული ვარ ასეთ მომენტებში,რადგან ვიცი ყოველთვის ჩემს მაქსიმუმს ვაჩვენებ ადამიანებს და ვფიქრობ ეს  დამსაქმებელსაც მოეწონება.
       </p>
     }
     {
       <p className={styles.about_description}>
     არანაკლებ მნიშვნელოვანი თემაა,რომელიც ხშირად აინტერესებთ ხოლმე და მეკითხებიან ჩემს პირად ცხოვრებაზე. არ მყავს ადამიანი გვერდით ვისთანაც მექნება სერიოზული ურთიერთობა. ჩანახატის დასაწყიში ვახსენენე ის ფაქტი,რომ  დიდი დრო დამჭირდა იმისათვის,რომ მზად ვყოფილიყავი ახალი ურთიერთობისათვის. არც ვახსენებ სახელს უბრალოდ ჩემ თავთან ვიქნები 100%-ით მართალი და ვიტყვი,რომ ეს ადამიანი ჩემი ცხოვრებიდან საერთოდ ამოიშალა ბოლომდე.სწორედ ეს გახდა იმის მიზეზი,რომ აღარ მეშინია ახალი ურთიერთობის დაწყების და პირიქით ძალიან ბევრ რამეზე დავფიქრდი წარსულის ურთიერთობებიდან. არც ერთ ჩემს გადადგმულ ნაბიჯს არ ვნანობ,პირიქით მიხარია, რადგან ყველაზე კარგი შედეგი მაშინ გაქვს,როცა საკუთარ შეცდომაზე სწავლობ. თან გავიზარდე შემეცვალა ბევრ საკითხთან დაკავშირებით დამოკიდებულება. თავისუფლება ძალიან მომწონს, თუმცა მეორე ნახევარი საერთოდ არ ნიშნავს იმას,რომ ეს თავისუფლება შეიზღუდება ან რამე მსგავსი მოხდება. არ ვგულისხმობ სხვადასხვა გოგოებთან ურთიერთობას, ეგეთი პიროვნება ისედაც არვარ ყველამ იცის, ვინც მიცნობს.
       </p>
     }
     {
       <p className={styles.about_description}>
        ბოლოდროინდელი ფიქრები სულ ამ ორ თემაზე მაქვს. რადგან ერთი მეორეს არ გამორიცხავს. 24 წლის ვხდები ოქტომბერში და ვფიქრობ,რომ ამჟამად ძალიან ჩამოვყალიბდი საკუთარ თავთან. გარკვეული პერიოდის უკან არ ვიყავი მზად სერიოზული ურთიერთობისთვის და პასუხისმგებლობის საკუთარ თავზე აღებისთვის მზად. ზოგადად იმ პერიოდში პასუხისმგებლობებს გავურბოდი და მივხვდი,რომ დიდხანს არ გაგრძელდებოდა ეს ყველაფერი. ვახსენე,რომ არ მყავს შეყვარებული  და არც ვეძებ. ეს ისეთი გრძნობაა, რომ აუცილებლად გამოჩნდება ისე,რომ ვერც გავიაზრებ ამ ყველაფერს. წარსულის მუროსგან განსხვავებით მზად ვარ ფსიქოლოგიურად,რომ ძალიან დიდი პასუხისმგებლობა ავიღო საკუთარ თავზე, თუმცა არ ვარ კარიერულად მზად. ეს ორი ,რამ ძალიან ეწინააღმდეგება ერთმანეთს და ხშირად მიწევს ამ საკითხზე ფიქრი. არ აქვს მნიშვნელობა რამდენად მზად ვიქნები შინაგანად ამისთვის თუ კარიერულად არ დავლაგდი ამ ნაბიჯს ვერასდროს გადავდგამ,რადგან ვალდებულება არ არის ჩემთვის ცოლის მოყვანა ამ ასაკში. მინდა,რომ  იდეალური ცხოვრება მქონდეს ჩემს მეუღლესთან ერთად და ამისათვის ყველაფერს ვიზამ. 
       </p>
     }
   </div>,
    <div key={7} className={styles.about_me}>
    <h2>თავი 7</h2>
    {
      <p className={styles.about_description}>

დავბრუნდი ძალიან დიდი ხნის შემდეგ, გადავდგი ისევ ის ნაბიჯი და დავიწყე წერა ჩემი სიმშვიდისთვის. ზუსტად არვიცი რამდენი დრო გავიდა ბოლო მოვლენების აღწერიდან, მაგრამ საკმაოდ ბევრი,რამ მოხდა. უკვე 2024 იწურება და მოდი შევაჯამებ როგორი წელი იყო ჩემთვის. ჩემთვის ძალიან კარგად დაიწყო,რადგან ვარჯიში დავიწყე და მივხვდი,რომ თურმე საკმაოდ ძლიერი ნებისყოფა მქონია. არ იყო ადვილი ამ ნაბიჯის გადადგმა,თუმცა რაც მიზნად დავისახე წინა წელს მგონია,რომ გამომივიდა და ჩემი თავის ბევრად უკეთესი ვერსია გავხდი. იმის მიუხედავად,რომ თავს ძალიან კარგად ვგრძნობ და უფრო სხვა თვალით ვუყურებ ყველაფერს, მაინც არის მომენტები,როდესაც ბევრი ფიქრი და ემოცია ერთად იყრის თავს. ამ ყველაფერს კონტროლი სჭირდება,თუმცა ყოველთვის არ გამომდის და არის სიტუაციები,როდესაც ვაძლევ საშუალებას ჩემს განწყობაზეც იმოქმედოს.  ძალიან კარგად მაქვს გააზრებული ის ფაქტი,რომ საკუთარ ემოციებს და საკუთარ თავს ვმართავ მე. ადამიანებთან საუბარი,რომ შემეძლოს საკუთარ თავზე და ელემენტარულ პრობლემებზეც, ალბათ ბევრად კარგად ვიქნებოდი, უბრალოდ არ შემიძლია ადამიანებთან გავიხსნა და ჩემს თავზე ვისაუბრო, ყოველთვის იმას ვამბობ,რომ შეიძლება 5% ვსაუბრობდე ჩემს მეგობრებთან.იმის მიუხედავად,რომ ვიცი ნებისმიერ სიტუაციაში გვერდში დამიდგებიან და არ განმსჯიან. საკმაოდ ბევრი რამ მოხდა კარგიც და ცუდიც. მანქანა ვიყიდე ამდენი წლის შემდეგ, მამაჩემმაც ცალკე მანქანა იყიდა, მაგრამ სამწუხაროდ გააფუჭა და დიდი ალბათობით მომიწევს მე ვათხოვო ხოლმე. ტელეფონი დავამტვრიე,რაც არც ისე კარგი არის ამ მომენტში. სამსახურიდან წამოსული ვარ და ჯერჯერობით ახალს ვეძებ, საერთოდ არმქონდა გათვლილი ახალი ტელეფონის ყიდვა,თუმცა საჭიროა. 
      </p>
    }
    {
      <p className={styles.about_description}>
        მე თვითონაც ვიაზრებ იმ ფაქტს,რომ საკუთარი თავი ყოველთვის დაძაბული მყავს და ყოველთვის ბევრს ვფიქრობ,ისეთ რამეებზე,რაც დროსთან ერთად მოგვარდება. ჩემს ძმაკაცთან საუბრის დროს დავიჭირე ეს სიტყვები და ზუსტად ამ მომენტში მივხვდი,რომ სწორს მეუბნებოდა. ძალიან დიდ და ბევრ პასუხისმგებლობას იღებ საკუთარ თავზეო,რაც ჯერჯერობით არ არის საჭირო ამ ასაკშიო. ჩემი უმეტესი ფიქრი არის იმ ფაქტზე,რომ მომავალი ავაწყო ისეთი,როგორიც მინდა. ამ ბოლო დროს ძალიან ბევრს ვფიქრობ ქვეყნიდან წასვლაზე უკეთესი მომავლის შესაქმნელად, თუმცა არის კიდევ ერთი ფაქტორი,რაც საფიქრალს მიმატებს და თან ეწინააღმდეგება ქვეყნიდან წასვლას. ეს საკითხი არის მეორე ნახევარი. არმყავს ამჟამად და სულ იმას ვფიქრობ,რომ  ქვეყნიდან,რომ ასე წავიდე დიდიხანი არ ჩამოვალ, სანამ არ ავეწყობი ნორმალურად. ამდენი წლის შემდეგ, რომ ჩამოვალ  ბინა მექნება და კაპიტალი,რომ რამე დავიწყო რა თქმა უნდა კარგია, მაგრამ თუ მეორე ნახევარი არმყავდა და ოჯახი არ შევმქენი რა აზრი აქვს, ანუ გამოდის  მარტო საკუთარი თავისთვის ვაწყობ იდეალურ მომავალს,თუმცა  გვერდში ძლიერი ქალის გარეშე არაფერია ბოლომდე იდეალური.
უკვე მოფიქრებული მაქვს წასვლა უცხოეთში, არმინდა ისე მოხდეს,რომ ადამიანთან დავიწყო ურთიერთობა და ამის გამო დავასრულო ყველაფერი, მაგრამ ამ შემთხვევაში აქ დარჩენა მომიწევს და ისევ იდეალური მომავლის შექმნისკენ სწრაფვა,თუმცა სხვა ხერხებით.რეალურად მაგისთვისაც მზად ვარ,რომ  აქ დავრჩე და ყველაფერი ვცადო, მაგრამ ვგრძნობ,რომ გვერდით მინდა ადამიანი ვისგანაც ვიგრძნობ სიყვარულს, კიდევ ერთხელ გამოვცდი ამ გრძნობას და მთელი ჩემი გულით იმ ადამიანის მხარეს ვიქნები.
საკმაოდ რთულია, როგორც ავღნიშნე არ მინდა ეს გრძნობა საერთოდ გავაქრო ჩემი ცხოვრებიდან და მხოლოდ კარიერაზე გადავერთო, მაგრამ არც იმისთვის ვარ მზად,რომ აქ საარსებო მინიმუმზე ვიყოდა შეყვარებული მყავდეს. იმიტომ,რომ ყოველთვის მიყვარს ადამიანის გახარება, საჩუქრები, ნებისმიერ ფასიანი ნივთი არ აქვს მნიშვნელობა, მთავარია,რომ ადამიანის სიამოვნებს და შენ მისი რეაქციები  და ემოციები განიჭებს ბედნიერებას.ამიტომ ყოველთვის ყველაფერს ვიზამ იმისათვის,რომ ჩემი მეორე ნახევარი ბედნიერი იყოს.

      </p>
    }
  </div>,
  ];

  const divsPerPage = 2;
  const totalPages = Math.ceil(divs.length / divsPerPage);
  const startIndex = (currentPage - 1) * divsPerPage;
  const endIndex = startIndex + divsPerPage;

  const currentDivs = divs.slice(startIndex, endIndex);

  return (
    <div>
      {currentDivs.map((div, index) => (
        <div key={index} className="content">
          {div}
        </div>
      ))}
      <div className={styles.pagination}>
        {Array.from({ length: totalPages }, (_, index) => (
          <button
            key={index + 1}
            onClick={() => handlePageChange(index + 1)}
            className={currentPage === index + 1 ? "active" : ""}
          >
            {index + 1}
          </button>
        ))}
      </div>
    </div>
  );
};

export default AboutMe;
